[Killed] ConditionalExpression
lib/password-validator.ts:93:21
         score = Math.max(0, score - 2);
     }
 
-    const isValid = metRequirements === 5 && password.length >= 12 && !COMMON_PASSWORDS.includes(password.toLowerCase());
+    const isValid = true && !COMMON_PASSWORDS.includes(password.toLowerCase());
 
     return {
killedBy: Password Validator - Traditional Unit Tests Weak password examples should reject password without uppercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
