[Survived] BooleanLiteral
components/Agents/AgentManager.tsx:82:46
 }) => {
   const [agents, setAgents] = useState<Agent[]>(initialAgents);
   const [selectedAgent, setSelectedAgent] = useState<Agent | null>(null);
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
   const [isModalOpen, setIsModalOpen] = useState(false);
   const { toast } = useToast();

[Killed] BooleanLiteral
components/Agents/AgentManager.tsx:83:50
   const [agents, setAgents] = useState<Agent[]>(initialAgents);
   const [selectedAgent, setSelectedAgent] = useState<Agent | null>(null);
   const [isLoading, setIsLoading] = useState(false);
-  const [isModalOpen, setIsModalOpen] = useState(false);
+  const [isModalOpen, setIsModalOpen] = useState(true);
   const { toast } = useToast();
 
killedBy: AgentManager renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements with the text: Create Agent

Here are the matching elements:

Ignored nodes: comments, script, style
<button
>

[Killed] ObjectLiteral
components/Agents/AgentManager.tsx:86:44
   const [isModalOpen, setIsModalOpen] = useState(false);
   const { toast } = useToast();
 
-  const [newAgent, setNewAgent] = useState({
-    name: "",
-    role: "",
-    capabilities: [] as string[],
-    config: {
-      model: "gpt-4",
-      temperature: 0.7,
-      maxTokens: 1000,
-    },
-  });
+  const [newAgent, setNewAgent] = useState({});
 
   const availableCapabilities = [
killedBy: AgentManager renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Survived] ArrayDeclaration
components/Agents/AgentManager.tsx:97:33
     },
   });
 
-  const availableCapabilities = [
-    "calendar_management",
-    "task_management",
-    "email_processing",
-    "document_analysis",
-    "financial_analysis",
-    "social_media",
-    "voice_commands",
-    "workflow_automation",
-  ];
+  const availableCapabilities = [];
 
   const handleCreateAgent = async () => {

[Survived] StringLiteral
components/Agents/AgentManager.tsx:99:5
 
   const availableCapabilities = [
     "calendar_management",
-    "task_management",
+    "",
     "email_processing",
     "document_analysis",

[Survived] StringLiteral
components/Agents/AgentManager.tsx:100:5
   const availableCapabilities = [
     "calendar_management",
     "task_management",
-    "email_processing",
+    "",
     "document_analysis",
     "financial_analysis",

[Survived] StringLiteral
components/Agents/AgentManager.tsx:101:5
     "calendar_management",
     "task_management",
     "email_processing",
-    "document_analysis",
+    "",
     "financial_analysis",
     "social_media",

[Survived] StringLiteral
components/Agents/AgentManager.tsx:102:5
     "task_management",
     "email_processing",
     "document_analysis",
-    "financial_analysis",
+    "",
     "social_media",
     "voice_commands",

[Survived] StringLiteral
components/Agents/AgentManager.tsx:103:5
     "email_processing",
     "document_analysis",
     "financial_analysis",
-    "social_media",
+    "",
     "voice_commands",
     "workflow_automation",

[Survived] StringLiteral
components/Agents/AgentManager.tsx:104:5
     "document_analysis",
     "financial_analysis",
     "social_media",
-    "voice_commands",
+    "",
     "workflow_automation",
   ];

[NoCoverage] BooleanLiteral
components/Agents/AgentManager.tsx:109:34
   ];
 
   const handleCreateAgent = async () => {
-    if (!newAgent.name.trim() || !newAgent.role.trim()) {
+    if (!newAgent.name.trim() || newAgent.role.trim()) {
       toast({
         title: "Validation Error",

[NoCoverage] ConditionalExpression
components/Agents/AgentManager.tsx:109:9
   ];
 
   const handleCreateAgent = async () => {
-    if (!newAgent.name.trim() || !newAgent.role.trim()) {
+    if (true) {
       toast({
         title: "Validation Error",

[NoCoverage] StringLiteral
components/Agents/AgentManager.tsx:112:22
     if (!newAgent.name.trim() || !newAgent.role.trim()) {
       toast({
         title: "Validation Error",
-        description: "Name and role are required",
+        description: "",
         variant: "error",
       });

[NoCoverage] StringLiteral
components/Agents/AgentManager.tsx:113:18
       toast({
         title: "Validation Error",
         description: "Name and role are required",
-        variant: "error",
+        variant: "",
       });
       return;

[NoCoverage] BooleanLiteral
components/Agents/AgentManager.tsx:118:18
       return;
     }
 
-    setIsLoading(true);
+    setIsLoading(false);
     try {
       const agentData = {

[NoCoverage] OptionalChaining
components/Agents/AgentManager.tsx:130:7
         },
       };
 
-      onAgentCreate?.(agentData);
+      onAgentCreate(agentData);
 
       // Simulate API call

[NoCoverage] BlockStatement
components/Agents/AgentManager.tsx:133:24
       onAgentCreate?.(agentData);
 
       // Simulate API call
-      setTimeout(() => {
-        const createdAgent: Agent = {
-          id: Date.now().toString(),
-          ...agentData,
-        };
-
-        setAgents((prev) => [...prev, createdAgent]);
-        setNewAgent({
-          name: "",
-          role: "",
-          capabilities: [],
-          config: {
-            model: "gpt-4",
-            temperature: 0.7,
-            maxTokens: 1000,
-          },
-        });
-        setIsModalOpen(false);
-
-        toast({
-          title: "Agent Created",
-          description: `${createdAgent.name} has been created successfully`,
-        });
-      }, 1000);
+      setTimeout(() => {}, 1000);
     } catch (error) {
       toast({

[NoCoverage] ArrowFunction
components/Agents/AgentManager.tsx:139:19
           ...agentData,
         };
 
-        setAgents((prev) => [...prev, createdAgent]);
+        setAgents(() => undefined);
         setNewAgent({
           name: "",

[NoCoverage] StringLiteral
components/Agents/AgentManager.tsx:141:17
 
         setAgents((prev) => [...prev, createdAgent]);
         setNewAgent({
-          name: "",
+          name: "Stryker was here!",
           role: "",
           capabilities: [],

[NoCoverage] BooleanLiteral
components/Agents/AgentManager.tsx:150:24
             maxTokens: 1000,
           },
         });
-        setIsModalOpen(false);
+        setIsModalOpen(true);
 
         toast({

[NoCoverage] ObjectLiteral
components/Agents/AgentManager.tsx:152:15
         });
         setIsModalOpen(false);
 
-        toast({
-          title: "Agent Created",
-          description: `${createdAgent.name} has been created successfully`,
-        });
+        toast({});
       }, 1000);
     } catch (error) {

[NoCoverage] BlockStatement
components/Agents/AgentManager.tsx:157:21
           description: `${createdAgent.name} has been created successfully`,
         });
       }, 1000);
-    } catch (error) {
-      toast({
-        title: "Error",
-        description: "Failed to create agent",
-        variant: "error",
-      });
-    } finally {
+    } catch (error) {} finally {
       setIsLoading(false);
     }

[NoCoverage] StringLiteral
components/Agents/AgentManager.tsx:161:18
       toast({
         title: "Error",
         description: "Failed to create agent",
-        variant: "error",
+        variant: "",
       });
     } finally {

[NoCoverage] BlockStatement
components/Agents/AgentManager.tsx:163:15
         description: "Failed to create agent",
         variant: "error",
       });
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   };
 

[Survived] BlockStatement
components/Agents/AgentManager.tsx:168:70
     }
   };
 
-  const handleUpdateAgent = (id: string, updates: Partial<Agent>) => {
-    setAgents((prev) =>
-      prev.map((agent) => (agent.id === id ? { ...agent, ...updates } : agent)),
-    );
-    onAgentUpdate?.(id, updates);
-  };
+  const handleUpdateAgent = (id: string, updates: Partial<Agent>) => {};
 
   const handleDeleteAgent = (id: string) => {

[Killed] ArrowFunction
components/Agents/AgentManager.tsx:169:15
   };
 
   const handleUpdateAgent = (id: string, updates: Partial<Agent>) => {
-    setAgents((prev) =>
-      prev.map((agent) => (agent.id === id ? { ...agent, ...updates } : agent)),
+    setAgents(() => undefined,
     );
     onAgentUpdate?.(id, updates);
killedBy: AgentManager calls onAgentStart when start button is clicked
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
components/Agents/AgentManager.tsx:170:16
 
   const handleUpdateAgent = (id: string, updates: Partial<Agent>) => {
     setAgents((prev) =>
-      prev.map((agent) => (agent.id === id ? { ...agent, ...updates } : agent)),
+      prev.map(() => undefined),
     );
     onAgentUpdate?.(id, updates);
killedBy: AgentManager calls onAgentStart when start button is clicked
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Survived] EqualityOperator
components/Agents/AgentManager.tsx:170:28
 
   const handleUpdateAgent = (id: string, updates: Partial<Agent>) => {
     setAgents((prev) =>
-      prev.map((agent) => (agent.id === id ? { ...agent, ...updates } : agent)),
+      prev.map((agent) => (agent.id !== id ? { ...agent, ...updates } : agent)),
     );
     onAgentUpdate?.(id, updates);

[Killed] OptionalChaining
components/Agents/AgentManager.tsx:172:5
     setAgents((prev) =>
       prev.map((agent) => (agent.id === id ? { ...agent, ...updates } : agent)),
     );
-    onAgentUpdate?.(id, updates);
+    onAgentUpdate(id, updates);
   };
 
killedBy: AgentManager calls onAgentStart when start button is clicked
statusReason: TypeError: onAgentUpdate is not a function

[NoCoverage] BlockStatement
components/Agents/AgentManager.tsx:175:45
     onAgentUpdate?.(id, updates);
   };
 
-  const handleDeleteAgent = (id: string) => {
-    setAgents((prev) => prev.filter((agent) => agent.id !== id));
-    onAgentDelete?.(id);
-
-    toast({
-      title: "Agent Deleted",
-      description: "Agent has been removed successfully",
-    });
-  };
+  const handleDeleteAgent = (id: string) => {};
 
   const handleStartAgent = (id: string) => {

[NoCoverage] ArrowFunction
components/Agents/AgentManager.tsx:176:15
   };
 
   const handleDeleteAgent = (id: string) => {
-    setAgents((prev) => prev.filter((agent) => agent.id !== id));
+    setAgents(() => undefined);
     onAgentDelete?.(id);
 

[NoCoverage] ConditionalExpression
components/Agents/AgentManager.tsx:176:48
   };
 
   const handleDeleteAgent = (id: string) => {
-    setAgents((prev) => prev.filter((agent) => agent.id !== id));
+    setAgents((prev) => prev.filter((agent) => true));
     onAgentDelete?.(id);
 

[NoCoverage] OptionalChaining
components/Agents/AgentManager.tsx:177:5
 
   const handleDeleteAgent = (id: string) => {
     setAgents((prev) => prev.filter((agent) => agent.id !== id));
-    onAgentDelete?.(id);
+    onAgentDelete(id);
 
     toast({

[NoCoverage] ObjectLiteral
components/Agents/AgentManager.tsx:179:11
     setAgents((prev) => prev.filter((agent) => agent.id !== id));
     onAgentDelete?.(id);
 
-    toast({
-      title: "Agent Deleted",
-      description: "Agent has been removed successfully",
-    });
+    toast({});
   };
 

[NoCoverage] StringLiteral
components/Agents/AgentManager.tsx:180:14
     onAgentDelete?.(id);
 
     toast({
-      title: "Agent Deleted",
+      title: "",
       description: "Agent has been removed successfully",
     });

[Killed] BlockStatement
components/Agents/AgentManager.tsx:185:44
     });
   };
 
-  const handleStartAgent = (id: string) => {
-    handleUpdateAgent(id, { status: "active" });
-    onAgentStart?.(id);
-
-    toast({
-      title: "Agent Started",
-      description: "Agent is now active and processing tasks",
-    });
-  };
+  const handleStartAgent = (id: string) => {};
 
   const handleStopAgent = (id: string) => {
killedBy: AgentManager calls onAgentStart when start button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Survived] StringLiteral
components/Agents/AgentManager.tsx:186:37
   };
 
   const handleStartAgent = (id: string) => {
-    handleUpdateAgent(id, { status: "active" });
+    handleUpdateAgent(id, { status: "" });
     onAgentStart?.(id);
 

[Survived] ObjectLiteral
components/Agents/AgentManager.tsx:186:27
   };
 
   const handleStartAgent = (id: string) => {
-    handleUpdateAgent(id, { status: "active" });
+    handleUpdateAgent(id, {});
     onAgentStart?.(id);
 

[Survived] OptionalChaining
components/Agents/AgentManager.tsx:187:5
 
   const handleStartAgent = (id: string) => {
     handleUpdateAgent(id, { status: "active" });
-    onAgentStart?.(id);
+    onAgentStart(id);
 
     toast({

[Survived] ObjectLiteral
components/Agents/AgentManager.tsx:189:11
     handleUpdateAgent(id, { status: "active" });
     onAgentStart?.(id);
 
-    toast({
-      title: "Agent Started",
-      description: "Agent is now active and processing tasks",
-    });
+    toast({});
   };
 

[Killed] BlockStatement
components/Agents/AgentManager.tsx:195:43
     });
   };
 
-  const handleStopAgent = (id: string) => {
-    handleUpdateAgent(id, { status: "inactive" });
-    onAgentStop?.(id);
-
-    toast({
-      title: "Agent Stopped",
-      description: "Agent has been deactivated",
-    });
-  };
+  const handleStopAgent = (id: string) => {};
 
   const toggleCapability = (capability: string) => {
killedBy: AgentManager calls onAgentStop when stop button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Survived] OptionalChaining
components/Agents/AgentManager.tsx:197:5
 
   const handleStopAgent = (id: string) => {
     handleUpdateAgent(id, { status: "inactive" });
-    onAgentStop?.(id);
+    onAgentStop(id);
 
     toast({

[Survived] ObjectLiteral
components/Agents/AgentManager.tsx:199:11
     handleUpdateAgent(id, { status: "inactive" });
     onAgentStop?.(id);
 
-    toast({
-      title: "Agent Stopped",
-      description: "Agent has been deactivated",
-    });
+    toast({});
   };
 

[NoCoverage] BlockStatement
components/Agents/AgentManager.tsx:205:52
     });
   };
 
-  const toggleCapability = (capability: string) => {
-    setNewAgent((prev) => ({
-      ...prev,
-      capabilities: prev.capabilities.includes(capability)
-        ? prev.capabilities.filter((c) => c !== capability)
-        : [...prev.capabilities, capability],
-    }));
-  };
+  const toggleCapability = (capability: string) => {};
 
   const getStatusColor = (status: Agent["status"]) => {

[NoCoverage] ArrowFunction
components/Agents/AgentManager.tsx:206:17
   };
 
   const toggleCapability = (capability: string) => {
-    setNewAgent((prev) => ({
-      ...prev,
-      capabilities: prev.capabilities.includes(capability)
-        ? prev.capabilities.filter((c) => c !== capability)
-        : [...prev.capabilities, capability],
-    }));
+    setNewAgent(() => undefined);
   };
 

[NoCoverage] ConditionalExpression
components/Agents/AgentManager.tsx:209:43
     setNewAgent((prev) => ({
       ...prev,
       capabilities: prev.capabilities.includes(capability)
-        ? prev.capabilities.filter((c) => c !== capability)
+        ? prev.capabilities.filter((c) => true)
         : [...prev.capabilities, capability],
     }));

[NoCoverage] EqualityOperator
components/Agents/AgentManager.tsx:209:43
     setNewAgent((prev) => ({
       ...prev,
       capabilities: prev.capabilities.includes(capability)
-        ? prev.capabilities.filter((c) => c !== capability)
+        ? prev.capabilities.filter((c) => c === capability)
         : [...prev.capabilities, capability],
     }));

[Survived] BlockStatement
components/Agents/AgentManager.tsx:214:55
     }));
   };
 
-  const getStatusColor = (status: Agent["status"]) => {
-    switch (status) {
-      case "active":
-        return "bg-green-500 hover:bg-green-600";
-      case "inactive":
-        return "bg-gray-500 hover:bg-gray-600";
-      case "error":
-        return "bg-red-500 hover:bg-red-600";
-      default:
-        return "bg-gray-500 hover:bg-gray-600";
-    }
-  };
+  const getStatusColor = (status: Agent["status"]) => {};
 
   return (

[Survived] ConditionalExpression
components/Agents/AgentManager.tsx:216:7
 
   const getStatusColor = (status: Agent["status"]) => {
     switch (status) {
-      case "active":
-        return "bg-green-500 hover:bg-green-600";
+      case "active":
       case "inactive":
         return "bg-gray-500 hover:bg-gray-600";

[Survived] ConditionalExpression
components/Agents/AgentManager.tsx:218:7
     switch (status) {
       case "active":
         return "bg-green-500 hover:bg-green-600";
-      case "inactive":
-        return "bg-gray-500 hover:bg-gray-600";
+      case "inactive":
       case "error":
         return "bg-red-500 hover:bg-red-600";

[Survived] ConditionalExpression
components/Agents/AgentManager.tsx:220:7
         return "bg-green-500 hover:bg-green-600";
       case "inactive":
         return "bg-gray-500 hover:bg-gray-600";
-      case "error":
-        return "bg-red-500 hover:bg-red-600";
+      case "error":
       default:
         return "bg-gray-500 hover:bg-gray-600";

[NoCoverage] ConditionalExpression
components/Agents/AgentManager.tsx:222:7
         return "bg-gray-500 hover:bg-gray-600";
       case "error":
         return "bg-red-500 hover:bg-red-600";
-      default:
-        return "bg-gray-500 hover:bg-gray-600";
+      default:
     }
   };

[Survived] BooleanLiteral
components/Agents/AgentManager.tsx:235:47
           <h2 className="text-2xl font-bold tracking-tight">Agent Manager</h2>
           <p className="text-gray-500">Manage and monitor your AI agents</p>
         </div>
-        <Button onClick={() => setIsModalOpen(true)}>
+        <Button onClick={() => setIsModalOpen(false)}>
           <Plus className="w-4 h-4 mr-2" />
           Create Agent

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:235:26
           <h2 className="text-2xl font-bold tracking-tight">Agent Manager</h2>
           <p className="text-gray-500">Manage and monitor your AI agents</p>
         </div>
-        <Button onClick={() => setIsModalOpen(true)}>
+        <Button onClick={() => undefined}>
           <Plus className="w-4 h-4 mr-2" />
           Create Agent

[Killed] ArrowFunction
components/Agents/AgentManager.tsx:264:43
               <div className="space-y-2">
                 <p className="font-medium text-sm">Capabilities</p>
                 <div className="flex flex-wrap gap-1">
-                  {agent.capabilities.map((capability) => (
-                    <Badge key={capability} variant="secondary" className="text-xs">
-                      {capability.replace("_", " ")}
-                    </Badge>
-                  ))}
+                  {agent.capabilities.map(() => undefined)}
                 </div>
               </div>
killedBy: AgentManager displays agent capabilities correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: web search. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] StringLiteral
components/Agents/AgentManager.tsx:266:43
                 <div className="flex flex-wrap gap-1">
                   {agent.capabilities.map((capability) => (
                     <Badge key={capability} variant="secondary" className="text-xs">
-                      {capability.replace("_", " ")}
+                      {capability.replace("", " ")}
                     </Badge>
                   ))}
killedBy: AgentManager displays agent capabilities correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: web search. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] StringLiteral
components/Agents/AgentManager.tsx:266:48
                 <div className="flex flex-wrap gap-1">
                   {agent.capabilities.map((capability) => (
                     <Badge key={capability} variant="secondary" className="text-xs">
-                      {capability.replace("_", " ")}
+                      {capability.replace("_", "")}
                     </Badge>
                   ))}
killedBy: AgentManager displays agent capabilities correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: web search. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ConditionalExpression
components/Agents/AgentManager.tsx:305:18
 
               {/* Actions */}
               <div className="flex items-center justify-end space-x-2 pt-2">
-                {agent.status === "active" ? (
+                {true ? (
                   <Button
                     size="sm"
killedBy: AgentManager shows start button for inactive agents
statusReason: TestingLibraryElementError: Unable to find an element with the text: Start. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ConditionalExpression
components/Agents/AgentManager.tsx:305:18
 
               {/* Actions */}
               <div className="flex items-center justify-end space-x-2 pt-2">
-                {agent.status === "active" ? (
+                {false ? (
                   <Button
                     size="sm"
killedBy: AgentManager shows stop button for active agents
statusReason: TestingLibraryElementError: Unable to find an element with the text: Stop. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ArrowFunction
components/Agents/AgentManager.tsx:309:30
                   <Button
                     size="sm"
                     variant="destructive"
-                    onClick={() => handleStopAgent(agent.id)}
+                    onClick={() => undefined}
                   >
                     <Square className="w-4 h-4 mr-2" />
killedBy: AgentManager calls onAgentStop when stop button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrowFunction
components/Agents/AgentManager.tsx:318:30
                   <Button
                     size="sm"
                     className="bg-green-600 hover:bg-green-700"
-                    onClick={() => handleStartAgent(agent.id)}
+                    onClick={() => undefined}
                   >
                     <Play className="w-4 h-4 mr-2" />
killedBy: AgentManager calls onAgentStart when start button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[NoCoverage] BlockStatement
components/Agents/AgentManager.tsx:327:34
                 <Button
                   size="sm"
                   variant="outline"
-                  onClick={() => {
-                    setSelectedAgent(agent);
-                    setNewAgent({
-                      name: agent.name,
-                      role: agent.role,
-                      capabilities: agent.capabilities,
-                      config: agent.config,
-                    });
-                    setIsModalOpen(true);
-                  }}
+                  onClick={() => {}}
                 >
                   <Edit className="w-4 h-4" />

[NoCoverage] ObjectLiteral
components/Agents/AgentManager.tsx:329:33
                   variant="outline"
                   onClick={() => {
                     setSelectedAgent(agent);
-                    setNewAgent({
-                      name: agent.name,
-                      role: agent.role,
-                      capabilities: agent.capabilities,
-                      config: agent.config,
-                    });
+                    setNewAgent({});
                     setIsModalOpen(true);
                   }}

[NoCoverage] BooleanLiteral
components/Agents/AgentManager.tsx:335:36
                       capabilities: agent.capabilities,
                       config: agent.config,
                     });
-                    setIsModalOpen(true);
+                    setIsModalOpen(false);
                   }}
                 >

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:344:28
                   size="sm"
                   variant="ghost"
                   className="text-red-500 hover:text-red-700 hover:bg-red-50"
-                  onClick={() => handleDeleteAgent(agent.id)}
+                  onClick={() => undefined}
                 >
                   <Trash2 className="w-4 h-4" />

[Killed] LogicalOperator
components/Agents/AgentManager.tsx:354:8
         ))}
       </div>
 
-      {agents.length === 0 && (
-        <Card>
-          <CardContent className="flex flex-col items-center justify-center py-12 space-y-4">
-            <Bot className="w-12 h-12 text-gray-400" />
-            <div className="text-center space-y-1">
-              <h3 className="text-lg font-medium">No Agents Created</h3>
-              <p className="text-gray-500">
-                Create your first agent to get started with multi-agent automation
-              </p>
-            </div>
-            <Button onClick={() => setIsModalOpen(true)}>
-              <Plus className="w-4 h-4 mr-2" />
-              Create First Agent
-            </Button>
-          </CardContent>
-        </Card>
-      )}
+      {agents.length === 0 || <Card>
+          <CardContent className="flex flex-col items-center justify-center py-12 space-y-4">
+            <Bot className="w-12 h-12 text-gray-400" />
+            <div className="text-center space-y-1">
+              <h3 className="text-lg font-medium">No Agents Created</h3>
+              <p className="text-gray-500">
+                Create your first agent to get started with multi-agent automation
+              </p>
+            </div>
+            <Button onClick={() => setIsModalOpen(true)}>
+              <Plus className="w-4 h-4 mr-2" />
+              Create First Agent
+            </Button>
+          </CardContent>
+        </Card>}
 
       {/* Create/Edit Agent Modal */}
killedBy: AgentManager handles empty agent list gracefully
statusReason: TestingLibraryElementError: Unable to find an element with the text: No Agents Created. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ConditionalExpression
components/Agents/AgentManager.tsx:354:8
         ))}
       </div>
 
-      {agents.length === 0 && (
-        <Card>
-          <CardContent className="flex flex-col items-center justify-center py-12 space-y-4">
-            <Bot className="w-12 h-12 text-gray-400" />
-            <div className="text-center space-y-1">
-              <h3 className="text-lg font-medium">No Agents Created</h3>
-              <p className="text-gray-500">
-                Create your first agent to get started with multi-agent automation
-              </p>
-            </div>
-            <Button onClick={() => setIsModalOpen(true)}>
-              <Plus className="w-4 h-4 mr-2" />
-              Create First Agent
-            </Button>
-          </CardContent>
-        </Card>
-      )}
+      {true}
 
       {/* Create/Edit Agent Modal */}
killedBy: AgentManager handles empty agent list gracefully
statusReason: TestingLibraryElementError: Unable to find an element with the text: No Agents Created. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:386:27
               <Label>Agent Name <span className="text-red-500">*</span></Label>
               <Input
                 value={newAgent.name}
-                onChange={(e) =>
-                  setNewAgent((prev) => ({ ...prev, name: e.target.value }))
+                onChange={() => undefined
                 }
                 placeholder="Enter agent name"

[NoCoverage] ArrowFunction
components/Agents/AgentManager.tsx:387:31
               <Input
                 value={newAgent.name}
                 onChange={(e) =>
-                  setNewAgent((prev) => ({ ...prev, name: e.target.value }))
+                  setNewAgent(() => undefined)
                 }
                 placeholder="Enter agent name"
