[NoCoverage] ObjectLiteral
components/Agents/AgentManager.tsx:387:42
               <Input
                 value={newAgent.name}
                 onChange={(e) =>
-                  setNewAgent((prev) => ({ ...prev, name: e.target.value }))
+                  setNewAgent((prev) => ({}))
                 }
                 placeholder="Enter agent name"

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:397:27
               <Label>Role <span className="text-red-500">*</span></Label>
               <Input
                 value={newAgent.role}
-                onChange={(e) =>
-                  setNewAgent((prev) => ({ ...prev, role: e.target.value }))
+                onChange={() => undefined
                 }
                 placeholder="Enter agent role"

[NoCoverage] ArrowFunction
components/Agents/AgentManager.tsx:398:31
               <Input
                 value={newAgent.role}
                 onChange={(e) =>
-                  setNewAgent((prev) => ({ ...prev, role: e.target.value }))
+                  setNewAgent(() => undefined)
                 }
                 placeholder="Enter agent role"

[NoCoverage] ObjectLiteral
components/Agents/AgentManager.tsx:398:42
               <Input
                 value={newAgent.role}
                 onChange={(e) =>
-                  setNewAgent((prev) => ({ ...prev, role: e.target.value }))
+                  setNewAgent((prev) => ({}))
                 }
                 placeholder="Enter agent role"

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:407:44
             <div className="space-y-2">
               <Label>Capabilities</Label>
               <div className="grid grid-cols-2 gap-2">
-                {availableCapabilities.map((capability) => (
-                  <Button
-                    key={capability}
-                    size="sm"
-                    variant={
-                      newAgent.capabilities.includes(capability)
-                        ? "default"
-                        : "outline"
-                    }
-                    onClick={() => toggleCapability(capability)}
-                    className="justify-start text-xs"
-                    type="button"
-                  >
-                    {newAgent.capabilities.includes(capability) && (
-                      <CheckCircle className="w-3 h-3 mr-2" />
-                    )}
-                    {capability.replace("_", " ")}
-                  </Button>
-                ))}
+                {availableCapabilities.map(() => undefined)}
               </div>
             </div>

[Survived] StringLiteral
components/Agents/AgentManager.tsx:414:27
                     variant={
                       newAgent.capabilities.includes(capability)
                         ? "default"
-                        : "outline"
+                        : ""
                     }
                     onClick={() => toggleCapability(capability)}

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:416:30
                         ? "default"
                         : "outline"
                     }
-                    onClick={() => toggleCapability(capability)}
+                    onClick={() => undefined}
                     className="justify-start text-xs"
                     type="button"

[Survived] ConditionalExpression
components/Agents/AgentManager.tsx:420:22
                     className="justify-start text-xs"
                     type="button"
                   >
-                    {newAgent.capabilities.includes(capability) && (
-                      <CheckCircle className="w-3 h-3 mr-2" />
-                    )}
+                    {false}
                     {capability.replace("_", " ")}
                   </Button>

[Survived] ConditionalExpression
components/Agents/AgentManager.tsx:420:22
                     className="justify-start text-xs"
                     type="button"
                   >
-                    {newAgent.capabilities.includes(capability) && (
-                      <CheckCircle className="w-3 h-3 mr-2" />
-                    )}
+                    {true}
                     {capability.replace("_", " ")}
                   </Button>

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:439:34
                 <Label>Model</Label>
                 <Select
                   value={newAgent.config.model}
-                  onValueChange={(value) =>
-                    setNewAgent((prev) => ({
-                      ...prev,
-                      config: { ...prev.config, model: value },
-                    }))
+                  onValueChange={() => undefined
                   }
                 >

[NoCoverage] ArrowFunction
components/Agents/AgentManager.tsx:440:33
                 <Select
                   value={newAgent.config.model}
                   onValueChange={(value) =>
-                    setNewAgent((prev) => ({
-                      ...prev,
-                      config: { ...prev.config, model: value },
-                    }))
+                    setNewAgent(() => undefined)
                   }
                 >

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:469:36
                     max={1}
                     step={0.1}
                     value={newAgent.config.temperature}
-                    onValueChange={(value) =>
-                      setNewAgent((prev) => ({
-                        ...prev,
-                        config: {
-                          ...prev.config,
-                          temperature: value,
-                        },
-                      }))
+                    onValueChange={() => undefined
                     }
                   />

[NoCoverage] ArrowFunction
components/Agents/AgentManager.tsx:470:35
                     step={0.1}
                     value={newAgent.config.temperature}
                     onValueChange={(value) =>
-                      setNewAgent((prev) => ({
-                        ...prev,
-                        config: {
-                          ...prev.config,
-                          temperature: value,
-                        },
-                      }))
+                      setNewAgent(() => undefined)
                     }
                   />

[NoCoverage] ObjectLiteral
components/Agents/AgentManager.tsx:472:33
                     onValueChange={(value) =>
                       setNewAgent((prev) => ({
                         ...prev,
-                        config: {
-                          ...prev.config,
-                          temperature: value,
-                        },
+                        config: {},
                       }))
                     }

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:491:36
                     max={4000}
                     step={100}
                     value={newAgent.config.maxTokens}
-                    onValueChange={(value) =>
-                      setNewAgent((prev) => ({
-                        ...prev,
-                        config: {
-                          ...prev.config,
-                          maxTokens: value,
-                        },
-                      }))
+                    onValueChange={() => undefined
                     }
                   />

[NoCoverage] ArrowFunction
components/Agents/AgentManager.tsx:492:35
                     step={100}
                     value={newAgent.config.maxTokens}
                     onValueChange={(value) =>
-                      setNewAgent((prev) => ({
-                        ...prev,
-                        config: {
-                          ...prev.config,
-                          maxTokens: value,
-                        },
-                      }))
+                      setNewAgent(() => undefined)
                     }
                   />

[NoCoverage] BooleanLiteral
components/Agents/AgentManager.tsx:516:69
           </div>
 
           <DialogFooter>
-            <Button variant="outline" onClick={() => setIsModalOpen(false)}>
+            <Button variant="outline" onClick={() => setIsModalOpen(true)}>
               Cancel
             </Button>

[Survived] ArrowFunction
components/Agents/AgentManager.tsx:516:48
           </div>
 
           <DialogFooter>
-            <Button variant="outline" onClick={() => setIsModalOpen(false)}>
+            <Button variant="outline" onClick={() => undefined}>
               Cancel
             </Button>

[NoCoverage] BooleanLiteral
components/Agents/AgentManager.tsx:521:63
             </Button>
             <Button
               onClick={handleCreateAgent}
-              disabled={isLoading || !newAgent.name.trim() || !newAgent.role.trim()}
+              disabled={isLoading || !newAgent.name.trim() || newAgent.role.trim()}
             >
               {isLoading && <Activity className="mr-2 h-4 w-4 animate-spin" />}

[Survived] ConditionalExpression
components/Agents/AgentManager.tsx:521:25
             </Button>
             <Button
               onClick={handleCreateAgent}
-              disabled={isLoading || !newAgent.name.trim() || !newAgent.role.trim()}
+              disabled={true}
             >
               {isLoading && <Activity className="mr-2 h-4 w-4 animate-spin" />}

[Survived] ConditionalExpression
components/Agents/AgentManager.tsx:523:16
               onClick={handleCreateAgent}
               disabled={isLoading || !newAgent.name.trim() || !newAgent.role.trim()}
             >
-              {isLoading && <Activity className="mr-2 h-4 w-4 animate-spin" />}
+              {false}
               {selectedAgent ? "Update Agent" : "Create Agent"}
             </Button>

[Survived] LogicalOperator
components/Agents/AgentManager.tsx:523:16
               onClick={handleCreateAgent}
               disabled={isLoading || !newAgent.name.trim() || !newAgent.role.trim()}
             >
-              {isLoading && <Activity className="mr-2 h-4 w-4 animate-spin" />}
+              {isLoading || <Activity className="mr-2 h-4 w-4 animate-spin" />}
               {selectedAgent ? "Update Agent" : "Create Agent"}
             </Button>
