[Killed] LogicalOperator
lib/crypto.ts:3:24
 import * as crypto from 'crypto';
 
-const ENCRYPTION_KEY = process.env.ENCRYPTION_KEY || 'default-dev-key-must-be-32-bytes-long!';
+const ENCRYPTION_KEY = process.env.ENCRYPTION_KEY && 'default-dev-key-must-be-32-bytes-long!';
 const IV_LENGTH = 16;
 
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: 166212586, path: "0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
lib/crypto.ts:3:24
 import * as crypto from 'crypto';
 
-const ENCRYPTION_KEY = process.env.ENCRYPTION_KEY || 'default-dev-key-must-be-32-bytes-long!';
+const ENCRYPTION_KEY = false;
 const IV_LENGTH = 16;
 
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: -211449154, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
lib/crypto.ts:6:47
 const ENCRYPTION_KEY = process.env.ENCRYPTION_KEY || 'default-dev-key-must-be-32-bytes-long!';
 const IV_LENGTH = 16;
 
-export function encrypt(text: string): string {
-    const iv = crypto.randomBytes(IV_LENGTH);
-    const key = ENCRYPTION_KEY.slice(0, 32).padEnd(32, '0');
-    // @ts-ignore - Node crypto types compatibility issue
-    const cipher = crypto.createCipheriv('aes-256-cbc', key, iv);
-    let encrypted = cipher.update(text, 'utf8', 'hex');
-    encrypted += cipher.final('hex');
-    return iv.toString('hex') + ':' + encrypted;
-}
+export function encrypt(text: string): string {}
 
 export function decrypt(text: string): string {
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: -135193701, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
lib/crypto.ts:8:17
 
 export function encrypt(text: string): string {
     const iv = crypto.randomBytes(IV_LENGTH);
-    const key = ENCRYPTION_KEY.slice(0, 32).padEnd(32, '0');
+    const key = ENCRYPTION_KEY.padEnd(32, '0');
     // @ts-ignore - Node crypto types compatibility issue
     const cipher = crypto.createCipheriv('aes-256-cbc', key, iv);
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: 140129458, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
lib/crypto.ts:11:49
     const key = ENCRYPTION_KEY.slice(0, 32).padEnd(32, '0');
     // @ts-ignore - Node crypto types compatibility issue
     const cipher = crypto.createCipheriv('aes-256-cbc', key, iv);
-    let encrypted = cipher.update(text, 'utf8', 'hex');
+    let encrypted = cipher.update(text, 'utf8', "");
     encrypted += cipher.final('hex');
     return iv.toString('hex') + ':' + encrypted;
killedBy: Crypto Utilities - Property-Based Tests should handle long strings correctly
statusReason: Error: Property failed after 1 tests
Shrunk 957 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] StringLiteral
lib/crypto.ts:11:41
     const key = ENCRYPTION_KEY.slice(0, 32).padEnd(32, '0');
     // @ts-ignore - Node crypto types compatibility issue
     const cipher = crypto.createCipheriv('aes-256-cbc', key, iv);
-    let encrypted = cipher.update(text, 'utf8', 'hex');
+    let encrypted = cipher.update(text, "", 'hex');
     encrypted += cipher.final('hex');
     return iv.toString('hex') + ':' + encrypted;

[Killed] AssignmentOperator
lib/crypto.ts:12:5
     // @ts-ignore - Node crypto types compatibility issue
     const cipher = crypto.createCipheriv('aes-256-cbc', key, iv);
     let encrypted = cipher.update(text, 'utf8', 'hex');
-    encrypted += cipher.final('hex');
+    encrypted -= cipher.final('hex');
     return iv.toString('hex') + ':' + encrypted;
 }
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: -144944913, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
lib/crypto.ts:12:31
     // @ts-ignore - Node crypto types compatibility issue
     const cipher = crypto.createCipheriv('aes-256-cbc', key, iv);
     let encrypted = cipher.update(text, 'utf8', 'hex');
-    encrypted += cipher.final('hex');
+    encrypted += cipher.final("");
     return iv.toString('hex') + ':' + encrypted;
 }
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: 1606322476, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
lib/crypto.ts:16:47
     return iv.toString('hex') + ':' + encrypted;
 }
 
-export function decrypt(text: string): string {
-    const textParts = text.split(':');
-    const ivHex = textParts.shift();
-    if (!ivHex) throw new Error('Invalid encrypted text format');
-    const iv = Buffer.from(ivHex, 'hex');
-    const encryptedText = textParts.join(':');
-    const key = ENCRYPTION_KEY.slice(0, 32).padEnd(32, '0');
-    // @ts-ignore - Node crypto types compatibility issue
-    const decipher = crypto.createDecipheriv('aes-256-cbc', key, iv);
-    let decrypted = decipher.update(encryptedText, 'hex', 'utf8');
-    decrypted += decipher.final('utf8');
-    return decrypted;
-}
+export function decrypt(text: string): string {}
 
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: -920576478, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
lib/crypto.ts:19:9
 export function decrypt(text: string): string {
     const textParts = text.split(':');
     const ivHex = textParts.shift();
-    if (!ivHex) throw new Error('Invalid encrypted text format');
+    if (ivHex) throw new Error('Invalid encrypted text format');
     const iv = Buffer.from(ivHex, 'hex');
     const encryptedText = textParts.join(':');
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: -157403369, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
lib/crypto.ts:19:9
 export function decrypt(text: string): string {
     const textParts = text.split(':');
     const ivHex = textParts.shift();
-    if (!ivHex) throw new Error('Invalid encrypted text format');
+    if (true) throw new Error('Invalid encrypted text format');
     const iv = Buffer.from(ivHex, 'hex');
     const encryptedText = textParts.join(':');
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: -1422441989, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
lib/crypto.ts:22:17
     if (!ivHex) throw new Error('Invalid encrypted text format');
     const iv = Buffer.from(ivHex, 'hex');
     const encryptedText = textParts.join(':');
-    const key = ENCRYPTION_KEY.slice(0, 32).padEnd(32, '0');
+    const key = ENCRYPTION_KEY.padEnd(32, '0');
     // @ts-ignore - Node crypto types compatibility issue
     const decipher = crypto.createDecipheriv('aes-256-cbc', key, iv);
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: -45624348, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
lib/crypto.ts:24:46
     const encryptedText = textParts.join(':');
     const key = ENCRYPTION_KEY.slice(0, 32).padEnd(32, '0');
     // @ts-ignore - Node crypto types compatibility issue
-    const decipher = crypto.createDecipheriv('aes-256-cbc', key, iv);
+    const decipher = crypto.createDecipheriv("", key, iv);
     let decrypted = decipher.update(encryptedText, 'hex', 'utf8');
     decrypted += decipher.final('utf8');
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: -2063120789, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
lib/crypto.ts:26:5
     // @ts-ignore - Node crypto types compatibility issue
     const decipher = crypto.createDecipheriv('aes-256-cbc', key, iv);
     let decrypted = decipher.update(encryptedText, 'hex', 'utf8');
-    decrypted += decipher.final('utf8');
+    decrypted -= decipher.final('utf8');
     return decrypted;
 }
killedBy: Crypto Utilities - Property-Based Tests should satisfy round-trip property: decrypt(encrypt(x)) === x
statusReason: Error: Property failed after 1 tests
{ seed: 934538188, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
