[NoCoverage] ArrayDeclaration
components/Voice/VoiceCommands.tsx:90:23
     onCommandCreate,
     onCommandUpdate,
     onCommandDelete,
-    initialCommands = [],
+    initialCommands = ["Stryker was here"],
     showNavigation = true,
     compactView = false,

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:91:22
     onCommandUpdate,
     onCommandDelete,
     initialCommands = [],
-    showNavigation = true,
+    showNavigation = false,
     compactView = false,
 }) => {

[Survived] BooleanLiteral
components/Voice/VoiceCommands.tsx:92:19
     onCommandDelete,
     initialCommands = [],
     showNavigation = true,
-    compactView = false,
+    compactView = true,
 }) => {
     const [isListening, setIsListening] = useState(false);

[Killed] BooleanLiteral
components/Voice/VoiceCommands.tsx:94:52
     showNavigation = true,
     compactView = false,
 }) => {
-    const [isListening, setIsListening] = useState(false);
+    const [isListening, setIsListening] = useState(true);
     const [isProcessing, setIsProcessing] = useState(false);
     const [recognitionResults, setRecognitionResults] = useState<
killedBy: VoiceCommands displays voice recognition status correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Inactive. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] BooleanLiteral
components/Voice/VoiceCommands.tsx:95:54
     compactView = false,
 }) => {
     const [isListening, setIsListening] = useState(false);
-    const [isProcessing, setIsProcessing] = useState(false);
+    const [isProcessing, setIsProcessing] = useState(true);
     const [recognitionResults, setRecognitionResults] = useState<
         VoiceRecognitionResult[]
killedBy: VoiceCommands allows starting and stopping voice recognition
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrayDeclaration
components/Voice/VoiceCommands.tsx:98:7
     const [isProcessing, setIsProcessing] = useState(false);
     const [recognitionResults, setRecognitionResults] = useState<
         VoiceRecognitionResult[]
-    >([]);
+    >(["Stryker was here"]);
     const [commands, setCommands] = useState<VoiceCommand[]>(initialCommands);
     const [selectedCommand, setSelectedCommand] = useState<VoiceCommand | null>(
killedBy: VoiceCommands renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'toLocaleTimeString')

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:103:64
     const [selectedCommand, setSelectedCommand] = useState<VoiceCommand | null>(
         null,
     );
-    const [currentTranscript, setCurrentTranscript] = useState("");
+    const [currentTranscript, setCurrentTranscript] = useState("Stryker was here!");
     const [confidence, setConfidence] = useState(0);
     const [recognition, setRecognition] = useState<any>(null);

[Killed] BooleanLiteral
components/Voice/VoiceCommands.tsx:106:66
     const [currentTranscript, setCurrentTranscript] = useState("");
     const [confidence, setConfidence] = useState(0);
     const [recognition, setRecognition] = useState<any>(null);
-    const [isCommandModalOpen, setIsCommandModalOpen] = useState(false);
+    const [isCommandModalOpen, setIsCommandModalOpen] = useState(true);
     const [isResultsOpen, setIsResultsOpen] = useState(false);
     const { toast } = useToast();
killedBy: VoiceCommands shows enabled badge for enabled commands
statusReason: TestingLibraryElementError: Found multiple elements with the text: Enabled

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="inline-flex items-center rounded-full border px-2.5 py-0.5 text-xs font-semibold transition-colors focus:outline-none focus:ring-2 focus:ring-ring focus:ring-offset-2 border-transparent text-primary-foreground bg-green-500 hover:bg-green-

[Survived] BooleanLiteral
components/Voice/VoiceCommands.tsx:107:56
     const [confidence, setConfidence] = useState(0);
     const [recognition, setRecognition] = useState<any>(null);
     const [isCommandModalOpen, setIsCommandModalOpen] = useState(false);
-    const [isResultsOpen, setIsResultsOpen] = useState(false);
+    const [isResultsOpen, setIsResultsOpen] = useState(true);
     const { toast } = useToast();
 

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:113:17
     // Default commands
     const defaultCommands: VoiceCommand[] = [
         {
-            id: "open_calendar",
+            id: "",
             phrase: "open calendar",
             action: "navigate",

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:114:21
     const defaultCommands: VoiceCommand[] = [
         {
             id: "open_calendar",
-            phrase: "open calendar",
+            phrase: "",
             action: "navigate",
             description: "Open the calendar view",

[Killed] BooleanLiteral
components/Voice/VoiceCommands.tsx:117:22
             phrase: "open calendar",
             action: "navigate",
             description: "Open the calendar view",
-            enabled: true,
+            enabled: false,
             confidenceThreshold: 0.7,
             parameters: { route: "/calendar" },
killedBy: VoiceCommands handles empty commands list
statusReason: TestingLibraryElementError: Unable to find an element with the text: Available Commands (3). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:119:34
             description: "Open the calendar view",
             enabled: true,
             confidenceThreshold: 0.7,
-            parameters: { route: "/calendar" },
+            parameters: { route: "" },
             usageCount: 0,
         },

[Killed] BooleanLiteral
components/Voice/VoiceCommands.tsx:127:22
             phrase: "create task",
             action: "create_task",
             description: "Create a new task",
-            enabled: true,
+            enabled: false,
             confidenceThreshold: 0.8,
             usageCount: 0,
killedBy: VoiceCommands handles empty commands list
statusReason: TestingLibraryElementError: Unable to find an element with the text: Available Commands (3). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:135:26
             id: "check_weather",
             phrase: "what's the weather",
             action: "get_weather",
-            description: "Get current weather information",
+            description: "",
             enabled: true,
             confidenceThreshold: 0.6,

[Killed] BooleanLiteral
components/Voice/VoiceCommands.tsx:136:22
             phrase: "what's the weather",
             action: "get_weather",
             description: "Get current weather information",
-            enabled: true,
+            enabled: false,
             confidenceThreshold: 0.6,
             usageCount: 0,
killedBy: VoiceCommands handles empty commands list
statusReason: TestingLibraryElementError: Unable to find an element with the text: Available Commands (3). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:141:17
             usageCount: 0,
         },
         {
-            id: "send_email",
+            id: "",
             phrase: "send email",
             action: "send_email",

[Killed] BooleanLiteral
components/Voice/VoiceCommands.tsx:145:22
             phrase: "send email",
             action: "send_email",
             description: "Compose and send an email",
-            enabled: false,
+            enabled: true,
             confidenceThreshold: 0.8,
             usageCount: 0,
killedBy: VoiceCommands handles empty commands list
statusReason: TestingLibraryElementError: Unable to find an element with the text: Available Commands (3). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ConditionalExpression
components/Voice/VoiceCommands.tsx:152:13
     ];
 
     useEffect(() => {
-        if (initialCommands.length === 0) {
+        if (true) {
             setCommands(defaultCommands);
         } else {
killedBy: VoiceCommands displays voice recognition status correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] EqualityOperator
components/Voice/VoiceCommands.tsx:152:13
     ];
 
     useEffect(() => {
-        if (initialCommands.length === 0) {
+        if (initialCommands.length !== 0) {
             setCommands(defaultCommands);
         } else {
killedBy: VoiceCommands displays voice recognition status correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] BlockStatement
components/Voice/VoiceCommands.tsx:154:16
     useEffect(() => {
         if (initialCommands.length === 0) {
             setCommands(defaultCommands);
-        } else {
-            setCommands(initialCommands);
-        }
+        } else {}
 
         // Initialize speech recognition

[Killed] EqualityOperator
components/Voice/VoiceCommands.tsx:159:13
         }
 
         // Initialize speech recognition
-        if (typeof window !== "undefined") {
+        if (typeof window === "undefined") {
             const SpeechRecognition =
                 (window as any).SpeechRecognition ||
killedBy: VoiceCommands allows starting and stopping voice recognition
statusReason: Error: expect(received).not.toBeNull()

Received: null

Ignored nodes: comments, script, style
<html>
  <head />
  <body

[Killed] ConditionalExpression
components/Voice/VoiceCommands.tsx:159:13
         }
 
         // Initialize speech recognition
-        if (typeof window !== "undefined") {
+        if (false) {
             const SpeechRecognition =
                 (window as any).SpeechRecognition ||
killedBy: VoiceCommands allows starting and stopping voice recognition
statusReason: Error: expect(received).not.toBeNull()

Received: null

Ignored nodes: comments, script, style
<html>
  <head />
  <body

[Killed] ConditionalExpression
components/Voice/VoiceCommands.tsx:161:17
         // Initialize speech recognition
         if (typeof window !== "undefined") {
             const SpeechRecognition =
-                (window as any).SpeechRecognition ||
-                (window as any).webkitSpeechRecognition;
+                true;
             if (SpeechRecognition) {
                 const recognitionInstance = new SpeechRecognition();
killedBy: VoiceCommands renders without crashing
statusReason: TypeError: SpeechRecognition is not a constructor

[Killed] ConditionalExpression
components/Voice/VoiceCommands.tsx:161:17
         // Initialize speech recognition
         if (typeof window !== "undefined") {
             const SpeechRecognition =
-                (window as any).SpeechRecognition ||
-                (window as any).webkitSpeechRecognition;
+                false;
             if (SpeechRecognition) {
                 const recognitionInstance = new SpeechRecognition();
killedBy: VoiceCommands allows starting and stopping voice recognition
statusReason: Error: expect(received).not.toBeNull()

Received: null

Ignored nodes: comments, script, style
<html>
  <head />
  <body

[Killed] ConditionalExpression
components/Voice/VoiceCommands.tsx:163:17
             const SpeechRecognition =
                 (window as any).SpeechRecognition ||
                 (window as any).webkitSpeechRecognition;
-            if (SpeechRecognition) {
+            if (false) {
                 const recognitionInstance = new SpeechRecognition();
                 recognitionInstance.continuous = true;
killedBy: VoiceCommands allows starting and stopping voice recognition
statusReason: Error: expect(received).not.toBeNull()

Received: null

Ignored nodes: comments, script, style
<html>
  <head />
  <body

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:163:17
             const SpeechRecognition =
                 (window as any).SpeechRecognition ||
                 (window as any).webkitSpeechRecognition;
-            if (SpeechRecognition) {
+            if (true) {
                 const recognitionInstance = new SpeechRecognition();
                 recognitionInstance.continuous = true;

[Survived] BooleanLiteral
components/Voice/VoiceCommands.tsx:165:50
                 (window as any).webkitSpeechRecognition;
             if (SpeechRecognition) {
                 const recognitionInstance = new SpeechRecognition();
-                recognitionInstance.continuous = true;
+                recognitionInstance.continuous = false;
                 recognitionInstance.interimResults = true;
                 recognitionInstance.lang = "en-US";

[Survived] BooleanLiteral
components/Voice/VoiceCommands.tsx:166:54
             if (SpeechRecognition) {
                 const recognitionInstance = new SpeechRecognition();
                 recognitionInstance.continuous = true;
-                recognitionInstance.interimResults = true;
+                recognitionInstance.interimResults = false;
                 recognitionInstance.lang = "en-US";
 

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:169:53
                 recognitionInstance.interimResults = true;
                 recognitionInstance.lang = "en-US";
 
-                recognitionInstance.onstart = () => {
-                    setIsListening(true);
-                    toast({
-                        title: "Voice recognition started",
-                        description: "Listening for commands...",
-                    });
-                };
+                recognitionInstance.onstart = () => {};
 
                 recognitionInstance.onend = () => {

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:170:36
                 recognitionInstance.lang = "en-US";
 
                 recognitionInstance.onstart = () => {
-                    setIsListening(true);
+                    setIsListening(false);
                     toast({
                         title: "Voice recognition started",

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:172:32
                 recognitionInstance.onstart = () => {
                     setIsListening(true);
                     toast({
-                        title: "Voice recognition started",
+                        title: "",
                         description: "Listening for commands...",
                     });

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:173:38
                     setIsListening(true);
                     toast({
                         title: "Voice recognition started",
-                        description: "Listening for commands...",
+                        description: "",
                     });
                 };

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:177:51
                     });
                 };
 
-                recognitionInstance.onend = () => {
-                    setIsListening(false);
-                };
+                recognitionInstance.onend = () => {};
 
                 recognitionInstance.onresult = (event: any) => {

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:178:36
                 };
 
                 recognitionInstance.onend = () => {
-                    setIsListening(false);
+                    setIsListening(true);
                 };
 

[Survived] BlockStatement
components/Voice/VoiceCommands.tsx:181:64
                     setIsListening(false);
                 };
 
-                recognitionInstance.onresult = (event: any) => {
-                    let finalTranscript = "";
-                    let interimTranscript = "";
-                    let currentConfidence = 0;
-
-                    for (let i = event.resultIndex; i < event.results.length; i++) {
-                        const transcript = event.results[i][0].transcript;
-                        const confidence = event.results[i][0].confidence;
-
-                        if (event.results[i].isFinal) {
-                            finalTranscript += transcript;
-                            currentConfidence = confidence;
-                        } else {
-                            interimTranscript += transcript;
-                        }
-                    }
-
-                    if (finalTranscript) {
-                        processVoiceCommand(finalTranscript, currentConfidence);
-                    } else if (interimTranscript) {
-                        setCurrentTranscript(interimTranscript);
-                        setConfidence(currentConfidence);
-                    }
-                };
+                recognitionInstance.onresult = (event: any) => {};
 
                 recognitionInstance.onerror = (event: any) => {

[Killed] UpdateOperator
components/Voice/VoiceCommands.tsx:186:79
                     let interimTranscript = "";
                     let currentConfidence = 0;
 
-                    for (let i = event.resultIndex; i < event.results.length; i++) {
+                    for (let i = event.resultIndex; i < event.results.length; i--) {
                         const transcript = event.results[i][0].transcript;
                         const confidence = event.results[i][0].confidence;
killedBy: VoiceCommands updates command usage count when executed
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading '0')"

      226 |                       } else {
      227 |                         stryCov_9fa48("250");
    > 228 |                         const transcript = event.results[i][0].transcript;

[Killed] EqualityOperator
components/Voice/VoiceCommands.tsx:186:53
                     let interimTranscript = "";
                     let currentConfidence = 0;
 
-                    for (let i = event.resultIndex; i < event.results.length; i++) {
+                    for (let i = event.resultIndex; i <= event.results.length; i++) {
                         const transcript = event.results[i][0].transcript;
                         const confidence = event.results[i][0].confidence;
killedBy: VoiceCommands updates command usage count when executed
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading '0')"

      226 |                       } else {
      227 |                         stryCov_9fa48("250");
    > 228 |                         const transcript = event.results[i][0].transcript;

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:190:29
                         const transcript = event.results[i][0].transcript;
                         const confidence = event.results[i][0].confidence;
 
-                        if (event.results[i].isFinal) {
+                        if (false) {
                             finalTranscript += transcript;
                             currentConfidence = confidence;

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:190:55
                         const transcript = event.results[i][0].transcript;
                         const confidence = event.results[i][0].confidence;
 
-                        if (event.results[i].isFinal) {
-                            finalTranscript += transcript;
-                            currentConfidence = confidence;
-                        } else {
+                        if (event.results[i].isFinal) {} else {
                             interimTranscript += transcript;
                         }

[NoCoverage] AssignmentOperator
components/Voice/VoiceCommands.tsx:191:29
                         const confidence = event.results[i][0].confidence;
 
                         if (event.results[i].isFinal) {
-                            finalTranscript += transcript;
+                            finalTranscript -= transcript;
                             currentConfidence = confidence;
                         } else {

[Survived] BlockStatement
components/Voice/VoiceCommands.tsx:193:32
                         if (event.results[i].isFinal) {
                             finalTranscript += transcript;
                             currentConfidence = confidence;
-                        } else {
-                            interimTranscript += transcript;
-                        }
+                        } else {}
                     }
 

[Survived] AssignmentOperator
components/Voice/VoiceCommands.tsx:194:29
                             finalTranscript += transcript;
                             currentConfidence = confidence;
                         } else {
-                            interimTranscript += transcript;
+                            interimTranscript -= transcript;
                         }
                     }

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:198:25
                         }
                     }
 
-                    if (finalTranscript) {
+                    if (true) {
                         processVoiceCommand(finalTranscript, currentConfidence);
                     } else if (interimTranscript) {

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:198:25
                         }
                     }
 
-                    if (finalTranscript) {
+                    if (false) {
                         processVoiceCommand(finalTranscript, currentConfidence);
                     } else if (interimTranscript) {

[Survived] BlockStatement
components/Voice/VoiceCommands.tsx:200:51
 
                     if (finalTranscript) {
                         processVoiceCommand(finalTranscript, currentConfidence);
-                    } else if (interimTranscript) {
-                        setCurrentTranscript(interimTranscript);
-                        setConfidence(currentConfidence);
-                    }
+                    } else if (interimTranscript) {}
                 };
 

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:200:32
 
                     if (finalTranscript) {
                         processVoiceCommand(finalTranscript, currentConfidence);
-                    } else if (interimTranscript) {
+                    } else if (false) {
                         setCurrentTranscript(interimTranscript);
                         setConfidence(currentConfidence);

[Survived] BlockStatement
components/Voice/VoiceCommands.tsx:206:63
                     }
                 };
 
-                recognitionInstance.onerror = (event: any) => {
-                    console.error("Speech recognition error:", event.error);
-                    toast({
-                        title: "Speech recognition error",
-                        description: event.error,
-                        variant: "error",
-                    });
-                    setIsListening(false);
-                };
+                recognitionInstance.onerror = (event: any) => {};
 
                 setRecognition(recognitionInstance);

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:207:35
                 };
 
                 recognitionInstance.onerror = (event: any) => {
-                    console.error("Speech recognition error:", event.error);
+                    console.error("", event.error);
                     toast({
                         title: "Speech recognition error",

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:211:34
                     toast({
                         title: "Speech recognition error",
                         description: event.error,
-                        variant: "error",
+                        variant: "",
                     });
                     setIsListening(false);

[Survived] BooleanLiteral
components/Voice/VoiceCommands.tsx:213:36
                         description: event.error,
                         variant: "error",
                     });
-                    setIsListening(false);
+                    setIsListening(true);
                 };
 

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:217:20
                 };
 
                 setRecognition(recognitionInstance);
-            } else {
-                toast({
-                    title: "Speech recognition not supported",
-                    description: "Your browser does not support speech recognition.",
-                    variant: "error",
-                });
-            }
+            } else {}
         }
 

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:220:34
             } else {
                 toast({
                     title: "Speech recognition not supported",
-                    description: "Your browser does not support speech recognition.",
+                    description: "",
                     variant: "error",
                 });

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:221:30
                 toast({
                     title: "Speech recognition not supported",
                     description: "Your browser does not support speech recognition.",
-                    variant: "error",
+                    variant: "",
                 });
             }

[Survived] BlockStatement
components/Voice/VoiceCommands.tsx:226:22
             }
         }
 
-        return () => {
-            if (recognition) {
-                recognition.stop();
-            }
-        };
+        return () => {};
     }, []);
 

[Killed] ConditionalExpression
components/Voice/VoiceCommands.tsx:227:17
         }
 
         return () => {
-            if (recognition) {
+            if (true) {
                 recognition.stop();
             }
killedBy: VoiceCommands renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'stop')

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:227:17
         }
 
         return () => {
-            if (recognition) {
+            if (false) {
                 recognition.stop();
             }

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:234:25
     }, []);
 
     const processVoiceCommand = (transcript: string, confidence: number) => {
-        setIsProcessing(true);
+        setIsProcessing(false);
         setCurrentTranscript(transcript);
         setConfidence(confidence);

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:240:13
 
         // Find matching command
         const matchedCommand = commands.find(
-            (command) =>
-                command.enabled &&
-                transcript.toLowerCase().includes(command.phrase.toLowerCase()) &&
-                confidence >= command.confidenceThreshold,
+            () => undefined,
         );
 

[NoCoverage] LogicalOperator
components/Voice/VoiceCommands.tsx:241:17
         // Find matching command
         const matchedCommand = commands.find(
             (command) =>
-                command.enabled &&
-                transcript.toLowerCase().includes(command.phrase.toLowerCase()) &&
+                command.enabled || transcript.toLowerCase().includes(command.phrase.toLowerCase()) &&
                 confidence >= command.confidenceThreshold,
         );

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:241:17
         // Find matching command
         const matchedCommand = commands.find(
             (command) =>
-                command.enabled &&
-                transcript.toLowerCase().includes(command.phrase.toLowerCase()) &&
-                confidence >= command.confidenceThreshold,
+                true,
         );
 

[NoCoverage] MethodExpression
components/Voice/VoiceCommands.tsx:242:51
         const matchedCommand = commands.find(
             (command) =>
                 command.enabled &&
-                transcript.toLowerCase().includes(command.phrase.toLowerCase()) &&
+                transcript.toLowerCase().includes(command.phrase.toUpperCase()) &&
                 confidence >= command.confidenceThreshold,
         );
