[Killed] ArrayDeclaration
lib/password-validator.ts:20:26
 }
 
 // Common weak passwords to check against
-const COMMON_PASSWORDS = [
-    'password', 'password123', '12345678', 'qwerty', 'abc123',
-    'monkey', 'letmein', 'trustno1', 'dragon', 'baseball',
-    'iloveyou', 'master', 'sunshine', 'ashley', 'bailey',
-    'passw0rd', 'shadow', '123456', '123456789', 'password1'
-];
+const COMMON_PASSWORDS = [];
 
 export function validatePassword(password: string): PasswordStrength {
killedBy: Password Validator - Traditional Unit Tests Common password detection should detect exact "password" as common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
lib/password-validator.ts:21:5
 
 // Common weak passwords to check against
 const COMMON_PASSWORDS = [
-    'password', 'password123', '12345678', 'qwerty', 'abc123',
+    "", 'password123', '12345678', 'qwerty', 'abc123',
     'monkey', 'letmein', 'trustno1', 'dragon', 'baseball',
     'iloveyou', 'master', 'sunshine', 'ashley', 'bailey',
killedBy: Password Validator - Traditional Unit Tests Common password detection should detect exact "password" as common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
lib/password-validator.ts:21:17
 
 // Common weak passwords to check against
 const COMMON_PASSWORDS = [
-    'password', 'password123', '12345678', 'qwerty', 'abc123',
+    'password', "", '12345678', 'qwerty', 'abc123',
     'monkey', 'letmein', 'trustno1', 'dragon', 'baseball',
     'iloveyou', 'master', 'sunshine', 'ashley', 'bailey',
killedBy: Password Validator - Property-Based Tests should detect common passwords
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
lib/password-validator.ts:23:39
 const COMMON_PASSWORDS = [
     'password', 'password123', '12345678', 'qwerty', 'abc123',
     'monkey', 'letmein', 'trustno1', 'dragon', 'baseball',
-    'iloveyou', 'master', 'sunshine', 'ashley', 'bailey',
+    'iloveyou', 'master', 'sunshine', "", 'bailey',
     'passw0rd', 'shadow', '123456', '123456789', 'password1'
 ];
killedBy: Password Validator - Traditional Unit Tests Common password detection should detect exact "ashley" as common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
lib/password-validator.ts:23:49
 const COMMON_PASSWORDS = [
     'password', 'password123', '12345678', 'qwerty', 'abc123',
     'monkey', 'letmein', 'trustno1', 'dragon', 'baseball',
-    'iloveyou', 'master', 'sunshine', 'ashley', 'bailey',
+    'iloveyou', 'master', 'sunshine', 'ashley', "",
     'passw0rd', 'shadow', '123456', '123456789', 'password1'
 ];
killedBy: Password Validator - Traditional Unit Tests Common password detection should detect exact "bailey" as common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
lib/password-validator.ts:24:37
     'password', 'password123', '12345678', 'qwerty', 'abc123',
     'monkey', 'letmein', 'trustno1', 'dragon', 'baseball',
     'iloveyou', 'master', 'sunshine', 'ashley', 'bailey',
-    'passw0rd', 'shadow', '123456', '123456789', 'password1'
+    'passw0rd', 'shadow', '123456', "", 'password1'
 ];
 
killedBy: Password Validator - Traditional Unit Tests Common password detection should detect exact "123456789" as common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
lib/password-validator.ts:24:5
     'password', 'password123', '12345678', 'qwerty', 'abc123',
     'monkey', 'letmein', 'trustno1', 'dragon', 'baseball',
     'iloveyou', 'master', 'sunshine', 'ashley', 'bailey',
-    'passw0rd', 'shadow', '123456', '123456789', 'password1'
+    "", 'shadow', '123456', '123456789', 'password1'
 ];
 
killedBy: Password Validator - Traditional Unit Tests Common password detection should detect exact "passw0rd" as common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
lib/password-validator.ts:31:26
     const feedback: string[] = [];
 
     // Check requirements
-    const requirements = {
-        minLength: password.length >= 12,
-        hasUppercase: /[A-Z]/.test(password),
-        hasLowercase: /[a-z]/.test(password),
-        hasNumber: /[0-9]/.test(password),
-        hasSpecialChar: /[!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]/.test(password),
-    };
+    const requirements = {};
 
     // Generate feedback
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate strong password with all requirements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
lib/password-validator.ts:32:20
 
     // Check requirements
     const requirements = {
-        minLength: password.length >= 12,
+        minLength: false,
         hasUppercase: /[A-Z]/.test(password),
         hasLowercase: /[a-z]/.test(password),
killedBy: Password Validator - Property-Based Tests should pass minLength for passwords with 12+ characters
statusReason: Error: Property failed after 1 tests
{ seed: -1658484633, path: "0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["            "]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
lib/password-validator.ts:32:20
 
     // Check requirements
     const requirements = {
-        minLength: password.length >= 12,
+        minLength: password.length > 12,
         hasUppercase: /[A-Z]/.test(password),
         hasLowercase: /[a-z]/.test(password),
killedBy: Password Validator - Property-Based Tests should pass minLength for passwords with 12+ characters
statusReason: Error: Property failed after 29 tests
{ seed: 2099708513, path: "28:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["            "]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
lib/password-validator.ts:35:20
         minLength: password.length >= 12,
         hasUppercase: /[A-Z]/.test(password),
         hasLowercase: /[a-z]/.test(password),
-        hasNumber: /[0-9]/.test(password),
+        hasNumber: /[^0-9]/.test(password),
         hasSpecialChar: /[!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]/.test(password),
     };
killedBy: Password Validator - Property-Based Tests should fail hasNumber for letters-only passwords
statusReason: Error: Property failed after 1 tests
{ seed: 1183918828, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [["a","a","a","a","a","a","a","a","a","a","a","a"]]
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
lib/password-validator.ts:36:25
         hasUppercase: /[A-Z]/.test(password),
         hasLowercase: /[a-z]/.test(password),
         hasNumber: /[0-9]/.test(password),
-        hasSpecialChar: /[!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]/.test(password),
+        hasSpecialChar: /[^!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]/.test(password),
     };
 
killedBy: Password Validator - Traditional Unit Tests Weak password examples should reject password without special characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
lib/password-validator.ts:40:9
     };
 
     // Generate feedback
-    if (!requirements.minLength) {
+    if (true) {
         feedback.push('Password must be at least 12 characters long');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Password must be at least 12 characters long"]

[Killed] BooleanLiteral
lib/password-validator.ts:40:9
     };
 
     // Generate feedback
-    if (!requirements.minLength) {
+    if (requirements.minLength) {
         feedback.push('Password must be at least 12 characters long');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Password must be at least 12 characters long"]

[Survived] StringLiteral
lib/password-validator.ts:41:23
 
     // Generate feedback
     if (!requirements.minLength) {
-        feedback.push('Password must be at least 12 characters long');
+        feedback.push("");
     }
     if (!requirements.hasUppercase) {

[Killed] ConditionalExpression
lib/password-validator.ts:43:9
     if (!requirements.minLength) {
         feedback.push('Password must be at least 12 characters long');
     }
-    if (!requirements.hasUppercase) {
+    if (true) {
         feedback.push('Include at least one uppercase letter (A-Z)');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Include at least one uppercase letter (A-Z)"]

[Killed] BooleanLiteral
lib/password-validator.ts:43:9
     if (!requirements.minLength) {
         feedback.push('Password must be at least 12 characters long');
     }
-    if (!requirements.hasUppercase) {
+    if (requirements.hasUppercase) {
         feedback.push('Include at least one uppercase letter (A-Z)');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Include at least one uppercase letter (A-Z)"]

[Survived] StringLiteral
lib/password-validator.ts:44:23
         feedback.push('Password must be at least 12 characters long');
     }
     if (!requirements.hasUppercase) {
-        feedback.push('Include at least one uppercase letter (A-Z)');
+        feedback.push("");
     }
     if (!requirements.hasLowercase) {

[Killed] BooleanLiteral
lib/password-validator.ts:46:9
     if (!requirements.hasUppercase) {
         feedback.push('Include at least one uppercase letter (A-Z)');
     }
-    if (!requirements.hasLowercase) {
+    if (requirements.hasLowercase) {
         feedback.push('Include at least one lowercase letter (a-z)');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Include at least one lowercase letter (a-z)"]

[Killed] ConditionalExpression
lib/password-validator.ts:46:9
     if (!requirements.hasUppercase) {
         feedback.push('Include at least one uppercase letter (A-Z)');
     }
-    if (!requirements.hasLowercase) {
+    if (true) {
         feedback.push('Include at least one lowercase letter (a-z)');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Include at least one lowercase letter (a-z)"]

[Killed] ConditionalExpression
lib/password-validator.ts:49:9
     if (!requirements.hasLowercase) {
         feedback.push('Include at least one lowercase letter (a-z)');
     }
-    if (!requirements.hasNumber) {
+    if (true) {
         feedback.push('Include at least one number (0-9)');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Include at least one number (0-9)"]

[Killed] BooleanLiteral
lib/password-validator.ts:49:9
     if (!requirements.hasLowercase) {
         feedback.push('Include at least one lowercase letter (a-z)');
     }
-    if (!requirements.hasNumber) {
+    if (requirements.hasNumber) {
         feedback.push('Include at least one number (0-9)');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Include at least one number (0-9)"]

[Survived] StringLiteral
lib/password-validator.ts:50:23
         feedback.push('Include at least one lowercase letter (a-z)');
     }
     if (!requirements.hasNumber) {
-        feedback.push('Include at least one number (0-9)');
+        feedback.push("");
     }
     if (!requirements.hasSpecialChar) {

[Killed] ConditionalExpression
lib/password-validator.ts:52:9
     if (!requirements.hasNumber) {
         feedback.push('Include at least one number (0-9)');
     }
-    if (!requirements.hasSpecialChar) {
+    if (true) {
         feedback.push('Include at least one special character (!@#$%^&*...)');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Include at least one special character (!@#$%^&*...)"]

[Killed] BooleanLiteral
lib/password-validator.ts:52:9
     if (!requirements.hasNumber) {
         feedback.push('Include at least one number (0-9)');
     }
-    if (!requirements.hasSpecialChar) {
+    if (requirements.hasSpecialChar) {
         feedback.push('Include at least one special character (!@#$%^&*...)');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Include at least one special character (!@#$%^&*...)"]

[Survived] StringLiteral
lib/password-validator.ts:53:23
         feedback.push('Include at least one number (0-9)');
     }
     if (!requirements.hasSpecialChar) {
-        feedback.push('Include at least one special character (!@#$%^&*...)');
+        feedback.push("");
     }
 

[Killed] BlockStatement
lib/password-validator.ts:57:60
     }
 
     // Check against common passwords
-    if (COMMON_PASSWORDS.includes(password.toLowerCase())) {
-        feedback.push('This password is too common. Please choose a more unique password.');
-    }
+    if (COMMON_PASSWORDS.includes(password.toLowerCase())) {}
 
     // Check for repeated characters
killedBy: Password Validator - Property-Based Tests should detect common passwords
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
lib/password-validator.ts:57:9
     }
 
     // Check against common passwords
-    if (COMMON_PASSWORDS.includes(password.toLowerCase())) {
+    if (true) {
         feedback.push('This password is too common. Please choose a more unique password.');
     }
killedBy: Password Validator - Traditional Unit Tests Common password detection should NOT detect strong password as common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
lib/password-validator.ts:58:23
 
     // Check against common passwords
     if (COMMON_PASSWORDS.includes(password.toLowerCase())) {
-        feedback.push('This password is too common. Please choose a more unique password.');
+        feedback.push("");
     }
 
killedBy: Password Validator - Property-Based Tests should detect common passwords
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
lib/password-validator.ts:62:9
     }
 
     // Check for repeated characters
-    if (/(.)\1{2,}/.test(password)) {
+    if (true) {
         feedback.push('Avoid repeated characters (e.g., "aaa" or "111")');
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: ["Avoid repeated characters (e.g., \"aaa\" or \"111\")"]

[Killed] ConditionalExpression
lib/password-validator.ts:62:9
     }
 
     // Check for repeated characters
-    if (/(.)\1{2,}/.test(password)) {
+    if (false) {
         feedback.push('Avoid repeated characters (e.g., "aaa" or "111")');
     }
killedBy: Password Validator - Traditional Unit Tests Repeating character detection should detect "aaa" pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
lib/password-validator.ts:68:24
 
     // Check for sequential characters
     const hasSequential = /(abc|bcd|cde|def|efg|fgh|ghi|hij|ijk|jkl|klm|lmn|mno|nop|opq|pqr|qrs|rst|stu|tuv|uvw|vwx|wxy|xyz|012|123|234|345|456|567|678|789)/i.test(password);
-    if (hasSequential) {
-        feedback.push('Avoid sequential characters (e.g., "abc" or "123")');
-    }
+    if (hasSequential) {}
 
     // Calculate score
killedBy: Password Validator - Traditional Unit Tests Sequential character detection should detect "abc" sequence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
lib/password-validator.ts:68:9
 
     // Check for sequential characters
     const hasSequential = /(abc|bcd|cde|def|efg|fgh|ghi|hij|ijk|jkl|klm|lmn|mno|nop|opq|pqr|qrs|rst|stu|tuv|uvw|vwx|wxy|xyz|012|123|234|345|456|567|678|789)/i.test(password);
-    if (hasSequential) {
+    if (false) {
         feedback.push('Avoid sequential characters (e.g., "abc" or "123")');
     }
killedBy: Password Validator - Traditional Unit Tests Sequential character detection should detect "abc" sequence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
lib/password-validator.ts:74:29
 
     // Calculate score
     let score = 0;
-    const metRequirements = Object.values(requirements).filter(Boolean).length;
+    const metRequirements = Object.values(requirements).length;
 
     if (metRequirements === 5 && password.length >= 12) {
killedBy: Password Validator - Traditional Unit Tests Weak password examples should reject password without uppercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
lib/password-validator.ts:76:57
     let score = 0;
     const metRequirements = Object.values(requirements).filter(Boolean).length;
 
-    if (metRequirements === 5 && password.length >= 12) {
-        score = 2; // Good
-        if (password.length >= 16) {
-            score = 3; // Strong
-        }
-        if (password.length >= 20 && !hasSequential) {
-            score = 4; // Very Strong
-        }
-    } else if (metRequirements >= 3) {
+    if (metRequirements === 5 && password.length >= 12) {} else if (metRequirements >= 3) {
         score = 1; // Fair
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate strong password with all requirements
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    0

[Killed] ConditionalExpression
lib/password-validator.ts:76:9
     let score = 0;
     const metRequirements = Object.values(requirements).filter(Boolean).length;
 
-    if (metRequirements === 5 && password.length >= 12) {
+    if (false) {
         score = 2; // Good
         if (password.length >= 16) {
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate strong password with all requirements
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1

[Survived] EqualityOperator
lib/password-validator.ts:78:13
 
     if (metRequirements === 5 && password.length >= 12) {
         score = 2; // Good
-        if (password.length >= 16) {
+        if (password.length < 16) {
             score = 3; // Strong
         }

[Survived] ConditionalExpression
lib/password-validator.ts:78:13
 
     if (metRequirements === 5 && password.length >= 12) {
         score = 2; // Good
-        if (password.length >= 16) {
+        if (false) {
             score = 3; // Strong
         }

[Killed] ConditionalExpression
lib/password-validator.ts:81:13
         if (password.length >= 16) {
             score = 3; // Strong
         }
-        if (password.length >= 20 && !hasSequential) {
+        if (false) {
             score = 4; // Very Strong
         }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] EqualityOperator
lib/password-validator.ts:81:13
         if (password.length >= 16) {
             score = 3; // Strong
         }
-        if (password.length >= 20 && !hasSequential) {
+        if (password.length < 20 && !hasSequential) {
             score = 4; // Very Strong
         }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Survived] ConditionalExpression
lib/password-validator.ts:84:16
         if (password.length >= 20 && !hasSequential) {
             score = 4; // Very Strong
         }
-    } else if (metRequirements >= 3) {
+    } else if (false) {
         score = 1; // Fair
     }

[Survived] ConditionalExpression
lib/password-validator.ts:84:16
         if (password.length >= 20 && !hasSequential) {
             score = 4; // Very Strong
         }
-    } else if (metRequirements >= 3) {
+    } else if (true) {
         score = 1; // Fair
     }

[Killed] ConditionalExpression
lib/password-validator.ts:89:9
     }
 
     // Penalize common passwords
-    if (COMMON_PASSWORDS.includes(password.toLowerCase())) {
+    if (true) {
         score = Math.max(0, score - 2);
     }
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate strong password with all requirements
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    1

[Survived] BlockStatement
lib/password-validator.ts:89:60
     }
 
     // Penalize common passwords
-    if (COMMON_PASSWORDS.includes(password.toLowerCase())) {
-        score = Math.max(0, score - 2);
-    }
+    if (COMMON_PASSWORDS.includes(password.toLowerCase())) {}
 
     const isValid = metRequirements === 5 && password.length >= 12 && !COMMON_PASSWORDS.includes(password.toLowerCase());

[Killed] ArithmeticOperator
lib/password-validator.ts:90:29
 
     // Penalize common passwords
     if (COMMON_PASSWORDS.includes(password.toLowerCase())) {
-        score = Math.max(0, score - 2);
+        score = Math.max(0, score + 2);
     }
 
killedBy: Password Validator - Traditional Unit Tests Common password detection should detect exact "password" as common
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 2
Received:   2

[Survived] MethodExpression
lib/password-validator.ts:90:17
 
     // Penalize common passwords
     if (COMMON_PASSWORDS.includes(password.toLowerCase())) {
-        score = Math.max(0, score - 2);
+        score = Math.min(0, score - 2);
     }
 

[Killed] ConditionalExpression
lib/password-validator.ts:93:21
         score = Math.max(0, score - 2);
     }
 
-    const isValid = metRequirements === 5 && password.length >= 12 && !COMMON_PASSWORDS.includes(password.toLowerCase());
+    const isValid = true && password.length >= 12 && !COMMON_PASSWORDS.includes(password.toLowerCase());
 
     return {
killedBy: Password Validator - Traditional Unit Tests Weak password examples should reject password without uppercase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
lib/password-validator.ts:93:21
         score = Math.max(0, score - 2);
     }
 
-    const isValid = metRequirements === 5 && password.length >= 12 && !COMMON_PASSWORDS.includes(password.toLowerCase());
+    const isValid = true;
 
     return {
killedBy: Password Validator - Property-Based Tests should have all requirements true when password is valid
statusReason: Error: Property failed after 1 tests
{ seed: -1037666444, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
lib/password-validator.ts:97:19
 
     return {
         score,
-        feedback: feedback.length > 0 ? feedback : ['Password meets all requirements'],
+        feedback: feedback.length >= 0 ? feedback : ['Password meets all requirements'],
         isValid,
         requirements,
killedBy: Password Validator - Traditional Unit Tests Strong password examples should validate very strong password
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Password meets all requirements"
Received array: []

[Killed] EqualityOperator
lib/password-validator.ts:97:19
 
     return {
         score,
-        feedback: feedback.length > 0 ? feedback : ['Password meets all requirements'],
+        feedback: feedback.length <= 0 ? feedback : ['Password meets all requirements'],
         isValid,
         requirements,
killedBy: Password Validator - Traditional Unit Tests Common password detection should detect exact "password" as common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
lib/password-validator.ts:103:65
     };
 }
 
-export function getPasswordStrengthLabel(score: number): string {
-    switch (score) {
-        case 0:
-            return 'Very Weak';
-        case 1:
-            return 'Weak';
-        case 2:
-            return 'Fair';
-        case 3:
-            return 'Strong';
-        case 4:
-            return 'Very Strong';
-        default:
-            return 'Unknown';
-    }
-}
+export function getPasswordStrengthLabel(score: number): string {}
 
 export function getPasswordStrengthColor(score: number): string {
killedBy: Password Validator - Traditional Unit Tests Strength labels should return "Very Weak" for score 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Very Weak"
Received: undefined

[Killed] ConditionalExpression
lib/password-validator.ts:105:9
 
 export function getPasswordStrengthLabel(score: number): string {
     switch (score) {
-        case 0:
-            return 'Very Weak';
+        case 0:
         case 1:
             return 'Weak';
killedBy: Password Validator - Traditional Unit Tests Strength labels should return "Very Weak" for score 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Very Weak"
Received: "Weak"

[Killed] StringLiteral
lib/password-validator.ts:106:20
 export function getPasswordStrengthLabel(score: number): string {
     switch (score) {
         case 0:
-            return 'Very Weak';
+            return "";
         case 1:
             return 'Weak';
killedBy: Password Validator - Traditional Unit Tests Strength labels should return "Very Weak" for score 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Very Weak"
Received: ""

[Killed] ConditionalExpression
lib/password-validator.ts:107:9
     switch (score) {
         case 0:
             return 'Very Weak';
-        case 1:
-            return 'Weak';
+        case 1:
         case 2:
             return 'Fair';
killedBy: Password Validator - Traditional Unit Tests Strength labels should return "Weak" for score 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Weak"
Received: "Fair"

[Killed] ConditionalExpression
lib/password-validator.ts:109:9
             return 'Very Weak';
         case 1:
             return 'Weak';
-        case 2:
-            return 'Fair';
+        case 2:
         case 3:
             return 'Strong';
killedBy: Password Validator - Traditional Unit Tests Strength labels should return "Fair" for score 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fair"
Received: "Strong"

[Killed] StringLiteral
lib/password-validator.ts:110:20
         case 1:
             return 'Weak';
         case 2:
-            return 'Fair';
+            return "";
         case 3:
             return 'Strong';
killedBy: Password Validator - Traditional Unit Tests Strength labels should return "Fair" for score 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fair"
Received: ""
