[NoCoverage] MethodExpression
components/Voice/VoiceCommands.tsx:242:17
         const matchedCommand = commands.find(
             (command) =>
                 command.enabled &&
-                transcript.toLowerCase().includes(command.phrase.toLowerCase()) &&
+                transcript.toUpperCase().includes(command.phrase.toLowerCase()) &&
                 confidence >= command.confidenceThreshold,
         );

[NoCoverage] EqualityOperator
components/Voice/VoiceCommands.tsx:243:17
             (command) =>
                 command.enabled &&
                 transcript.toLowerCase().includes(command.phrase.toLowerCase()) &&
-                confidence >= command.confidenceThreshold,
+                confidence > command.confidenceThreshold,
         );
 

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:243:17
             (command) =>
                 command.enabled &&
                 transcript.toLowerCase().includes(command.phrase.toLowerCase()) &&
-                confidence >= command.confidenceThreshold,
+                true,
         );
 

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:252:25
             transcript,
             confidence,
             command: matchedCommand,
-            processed: !!matchedCommand,
+            processed: !matchedCommand,
         };
 

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:255:31
             processed: !!matchedCommand,
         };
 
-        setRecognitionResults((prev) => [result, ...prev.slice(0, 9)]); // Keep last 10 results
+        setRecognitionResults(() => undefined); // Keep last 10 results
         onCommandRecognized?.(result);
 

[NoCoverage] MethodExpression
components/Voice/VoiceCommands.tsx:255:53
             processed: !!matchedCommand,
         };
 
-        setRecognitionResults((prev) => [result, ...prev.slice(0, 9)]); // Keep last 10 results
+        setRecognitionResults((prev) => [result, ...prev]); // Keep last 10 results
         onCommandRecognized?.(result);
 

[NoCoverage] OptionalChaining
components/Voice/VoiceCommands.tsx:256:9
         };
 
         setRecognitionResults((prev) => [result, ...prev.slice(0, 9)]); // Keep last 10 results
-        onCommandRecognized?.(result);
+        onCommandRecognized(result);
 
         if (matchedCommand) {

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:258:13
         setRecognitionResults((prev) => [result, ...prev.slice(0, 9)]); // Keep last 10 results
         onCommandRecognized?.(result);
 
-        if (matchedCommand) {
+        if (false) {
             // Update command usage
             const updatedCommand = {

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:258:29
         setRecognitionResults((prev) => [result, ...prev.slice(0, 9)]); // Keep last 10 results
         onCommandRecognized?.(result);
 
-        if (matchedCommand) {
-            // Update command usage
-            const updatedCommand = {
-                ...matchedCommand,
-                lastUsed: new Date(),
-                usageCount: matchedCommand.usageCount + 1,
-            };
-            handleUpdateCommand(matchedCommand.id, updatedCommand);
-
-            // Execute command
-            onCommandExecute?.(matchedCommand, matchedCommand.parameters);
-
-            toast({
-                title: "Command executed",
-                description: `"${matchedCommand.phrase}" - ${matchedCommand.description}`,
-            });
-        } else {
+        if (matchedCommand) {} else {
             toast({
                 title: "No matching command found",

[NoCoverage] ArithmeticOperator
components/Voice/VoiceCommands.tsx:263:29
             const updatedCommand = {
                 ...matchedCommand,
                 lastUsed: new Date(),
-                usageCount: matchedCommand.usageCount + 1,
+                usageCount: matchedCommand.usageCount - 1,
             };
             handleUpdateCommand(matchedCommand.id, updatedCommand);

[NoCoverage] OptionalChaining
components/Voice/VoiceCommands.tsx:268:13
             handleUpdateCommand(matchedCommand.id, updatedCommand);
 
             // Execute command
-            onCommandExecute?.(matchedCommand, matchedCommand.parameters);
+            onCommandExecute(matchedCommand, matchedCommand.parameters);
 
             toast({

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:274:16
                 title: "Command executed",
                 description: `"${matchedCommand.phrase}" - ${matchedCommand.description}`,
             });
-        } else {
-            toast({
-                title: "No matching command found",
-                description: `"${transcript}" (${Math.round(confidence * 100)}% confidence)`,
-                variant: "error", // Using destructive for warning-like visual
-            });
-        }
+        } else {}
 
         setIsProcessing(false);

[NoCoverage] ArithmeticOperator
components/Voice/VoiceCommands.tsx:277:61
         } else {
             toast({
                 title: "No matching command found",
-                description: `"${transcript}" (${Math.round(confidence * 100)}% confidence)`,
+                description: `"${transcript}" (${Math.round(confidence / 100)}% confidence)`,
                 variant: "error", // Using destructive for warning-like visual
             });

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:282:25
             });
         }
 
-        setIsProcessing(false);
+        setIsProcessing(true);
         setCurrentTranscript("");
     };

[Killed] BlockStatement
components/Voice/VoiceCommands.tsx:286:34
         setCurrentTranscript("");
     };
 
-    const startListening = () => {
-        if (recognition && !isListening) {
-            try {
-                recognition.start();
-            } catch (error) {
-                console.error("Error starting speech recognition:", error);
-                toast({
-                    title: "Error starting voice recognition",
-                    variant: "error",
-                });
-            }
-        }
-    };
+    const startListening = () => {};
 
     const stopListening = () => {
killedBy: VoiceCommands allows starting and stopping voice recognition
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
components/Voice/VoiceCommands.tsx:287:42
     };
 
     const startListening = () => {
-        if (recognition && !isListening) {
-            try {
-                recognition.start();
-            } catch (error) {
-                console.error("Error starting speech recognition:", error);
-                toast({
-                    title: "Error starting voice recognition",
-                    variant: "error",
-                });
-            }
-        }
+        if (recognition && !isListening) {}
     };
 
killedBy: VoiceCommands allows starting and stopping voice recognition
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
components/Voice/VoiceCommands.tsx:287:28
     };
 
     const startListening = () => {
-        if (recognition && !isListening) {
+        if (recognition && isListening) {
             try {
                 recognition.start();
killedBy: VoiceCommands allows starting and stopping voice recognition
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
components/Voice/VoiceCommands.tsx:288:17
 
     const startListening = () => {
         if (recognition && !isListening) {
-            try {
-                recognition.start();
-            } catch (error) {
+            try {} catch (error) {
                 console.error("Error starting speech recognition:", error);
                 toast({
killedBy: VoiceCommands allows starting and stopping voice recognition
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:290:29
         if (recognition && !isListening) {
             try {
                 recognition.start();
-            } catch (error) {
-                console.error("Error starting speech recognition:", error);
-                toast({
-                    title: "Error starting voice recognition",
-                    variant: "error",
-                });
-            }
+            } catch (error) {}
         }
     };

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:291:31
             try {
                 recognition.start();
             } catch (error) {
-                console.error("Error starting speech recognition:", error);
+                console.error("", error);
                 toast({
                     title: "Error starting voice recognition",

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:300:33
         }
     };
 
-    const stopListening = () => {
-        if (recognition && isListening) {
-            recognition.stop();
-        }
-    };
+    const stopListening = () => {};
 
     const handleCreateCommand = (

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:301:13
     };
 
     const stopListening = () => {
-        if (recognition && isListening) {
+        if (false) {
             recognition.stop();
         }

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:301:41
     };
 
     const stopListening = () => {
-        if (recognition && isListening) {
-            recognition.stop();
-        }
+        if (recognition && isListening) {}
     };
 

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:308:10
 
     const handleCreateCommand = (
         commandData: Omit<VoiceCommand, "id" | "usageCount">,
-    ) => {
-        const newCommand: VoiceCommand = {
-            ...commandData,
-            id: Date.now().toString(),
-            usageCount: 0,
-        };
-        setCommands((prev) => [...prev, newCommand]);
-        onCommandCreate?.(newCommand);
-        toast({
-            title: "Command created",
-            description: "New voice command has been added.",
-        });
-        setIsCommandModalOpen(false);
-    };
+    ) => {};
 
     const handleUpdateCommand = (

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:314:21
             id: Date.now().toString(),
             usageCount: 0,
         };
-        setCommands((prev) => [...prev, newCommand]);
+        setCommands(() => undefined);
         onCommandCreate?.(newCommand);
         toast({

[NoCoverage] ArrayDeclaration
components/Voice/VoiceCommands.tsx:314:31
             id: Date.now().toString(),
             usageCount: 0,
         };
-        setCommands((prev) => [...prev, newCommand]);
+        setCommands((prev) => []);
         onCommandCreate?.(newCommand);
         toast({

[NoCoverage] OptionalChaining
components/Voice/VoiceCommands.tsx:315:9
             usageCount: 0,
         };
         setCommands((prev) => [...prev, newCommand]);
-        onCommandCreate?.(newCommand);
+        onCommandCreate(newCommand);
         toast({
             title: "Command created",

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:320:31
             title: "Command created",
             description: "New voice command has been added.",
         });
-        setIsCommandModalOpen(false);
+        setIsCommandModalOpen(true);
     };
 

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:326:10
     const handleUpdateCommand = (
         commandId: string,
         updates: Partial<VoiceCommand>,
-    ) => {
-        setCommands((prev) =>
-            prev.map((command) =>
-                command.id === commandId ? { ...command, ...updates } : command,
-            ),
-        );
-        onCommandUpdate?.(commandId, updates);
-        if (isCommandModalOpen) {
-            toast({
-                title: "Command updated",
-                description: "Voice command has been updated.",
-            });
-            setIsCommandModalOpen(false);
-        }
-    };
+    ) => {};
 
     const handleDeleteCommand = (commandId: string) => {

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:327:21
         commandId: string,
         updates: Partial<VoiceCommand>,
     ) => {
-        setCommands((prev) =>
-            prev.map((command) =>
-                command.id === commandId ? { ...command, ...updates } : command,
-            ),
+        setCommands(() => undefined,
         );
         onCommandUpdate?.(commandId, updates);

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:328:22
         updates: Partial<VoiceCommand>,
     ) => {
         setCommands((prev) =>
-            prev.map((command) =>
-                command.id === commandId ? { ...command, ...updates } : command,
+            prev.map(() => undefined,
             ),
         );

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:329:17
     ) => {
         setCommands((prev) =>
             prev.map((command) =>
-                command.id === commandId ? { ...command, ...updates } : command,
+                false ? { ...command, ...updates } : command,
             ),
         );

[NoCoverage] EqualityOperator
components/Voice/VoiceCommands.tsx:329:17
     ) => {
         setCommands((prev) =>
             prev.map((command) =>
-                command.id === commandId ? { ...command, ...updates } : command,
+                command.id !== commandId ? { ...command, ...updates } : command,
             ),
         );

[NoCoverage] OptionalChaining
components/Voice/VoiceCommands.tsx:332:9
                 command.id === commandId ? { ...command, ...updates } : command,
             ),
         );
-        onCommandUpdate?.(commandId, updates);
+        onCommandUpdate(commandId, updates);
         if (isCommandModalOpen) {
             toast({

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:333:13
             ),
         );
         onCommandUpdate?.(commandId, updates);
-        if (isCommandModalOpen) {
+        if (false) {
             toast({
                 title: "Command updated",

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:333:13
             ),
         );
         onCommandUpdate?.(commandId, updates);
-        if (isCommandModalOpen) {
+        if (true) {
             toast({
                 title: "Command updated",

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:336:30
         if (isCommandModalOpen) {
             toast({
                 title: "Command updated",
-                description: "Voice command has been updated.",
+                description: "",
             });
             setIsCommandModalOpen(false);

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:342:56
         }
     };
 
-    const handleDeleteCommand = (commandId: string) => {
-        setCommands((prev) => prev.filter((command) => command.id !== commandId));
-        onCommandDelete?.(commandId);
-        toast({
-            title: "Command deleted",
-            description: "Voice command has been removed.",
-        });
-    };
+    const handleDeleteCommand = (commandId: string) => {};
 
     const toggleCommandEnabled = (commandId: string) => {

[NoCoverage] MethodExpression
components/Voice/VoiceCommands.tsx:343:31
     };
 
     const handleDeleteCommand = (commandId: string) => {
-        setCommands((prev) => prev.filter((command) => command.id !== commandId));
+        setCommands((prev) => prev);
         onCommandDelete?.(commandId);
         toast({

[NoCoverage] EqualityOperator
components/Voice/VoiceCommands.tsx:343:56
     };
 
     const handleDeleteCommand = (commandId: string) => {
-        setCommands((prev) => prev.filter((command) => command.id !== commandId));
+        setCommands((prev) => prev.filter((command) => command.id === commandId));
         onCommandDelete?.(commandId);
         toast({

[NoCoverage] OptionalChaining
components/Voice/VoiceCommands.tsx:344:9
 
     const handleDeleteCommand = (commandId: string) => {
         setCommands((prev) => prev.filter((command) => command.id !== commandId));
-        onCommandDelete?.(commandId);
+        onCommandDelete(commandId);
         toast({
             title: "Command deleted",

[NoCoverage] ObjectLiteral
components/Voice/VoiceCommands.tsx:345:15
     const handleDeleteCommand = (commandId: string) => {
         setCommands((prev) => prev.filter((command) => command.id !== commandId));
         onCommandDelete?.(commandId);
-        toast({
-            title: "Command deleted",
-            description: "Voice command has been removed.",
-        });
+        toast({});
     };
 

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:347:26
         onCommandDelete?.(commandId);
         toast({
             title: "Command deleted",
-            description: "Voice command has been removed.",
+            description: "",
         });
     };

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:351:57
         });
     };
 
-    const toggleCommandEnabled = (commandId: string) => {
-        const command = commands.find((c) => c.id === commandId);
-        if (command) {
-            handleUpdateCommand(commandId, { enabled: !command.enabled });
-        }
-    };
+    const toggleCommandEnabled = (commandId: string) => {};
 
     const getConfidenceColor = (confidence: number) => {

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:352:39
     };
 
     const toggleCommandEnabled = (commandId: string) => {
-        const command = commands.find((c) => c.id === commandId);
+        const command = commands.find(() => undefined);
         if (command) {
             handleUpdateCommand(commandId, { enabled: !command.enabled });

[NoCoverage] EqualityOperator
components/Voice/VoiceCommands.tsx:352:46
     };
 
     const toggleCommandEnabled = (commandId: string) => {
-        const command = commands.find((c) => c.id === commandId);
+        const command = commands.find((c) => c.id !== commandId);
         if (command) {
             handleUpdateCommand(commandId, { enabled: !command.enabled });

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:353:13
 
     const toggleCommandEnabled = (commandId: string) => {
         const command = commands.find((c) => c.id === commandId);
-        if (command) {
+        if (false) {
             handleUpdateCommand(commandId, { enabled: !command.enabled });
         }

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:353:13
 
     const toggleCommandEnabled = (commandId: string) => {
         const command = commands.find((c) => c.id === commandId);
-        if (command) {
+        if (true) {
             handleUpdateCommand(commandId, { enabled: !command.enabled });
         }

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:354:55
     const toggleCommandEnabled = (commandId: string) => {
         const command = commands.find((c) => c.id === commandId);
         if (command) {
-            handleUpdateCommand(commandId, { enabled: !command.enabled });
+            handleUpdateCommand(commandId, { enabled: command.enabled });
         }
     };

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:358:56
         }
     };
 
-    const getConfidenceColor = (confidence: number) => {
-        if (confidence >= 0.8) return "bg-green-500";
-        if (confidence >= 0.6) return "bg-yellow-500";
-        return "bg-red-500";
-    };
+    const getConfidenceColor = (confidence: number) => {};
 
     const CommandForm: React.FC<{

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:359:13
     };
 
     const getConfidenceColor = (confidence: number) => {
-        if (confidence >= 0.8) return "bg-green-500";
+        if (false) return "bg-green-500";
         if (confidence >= 0.6) return "bg-yellow-500";
         return "bg-red-500";

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:359:13
     };
 
     const getConfidenceColor = (confidence: number) => {
-        if (confidence >= 0.8) return "bg-green-500";
+        if (true) return "bg-green-500";
         if (confidence >= 0.6) return "bg-yellow-500";
         return "bg-red-500";

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:360:13
 
     const getConfidenceColor = (confidence: number) => {
         if (confidence >= 0.8) return "bg-green-500";
-        if (confidence >= 0.6) return "bg-yellow-500";
+        if (false) return "bg-yellow-500";
         return "bg-red-500";
     };

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:360:13
 
     const getConfidenceColor = (confidence: number) => {
         if (confidence >= 0.8) return "bg-green-500";
-        if (confidence >= 0.6) return "bg-yellow-500";
+        if (true) return "bg-yellow-500";
         return "bg-red-500";
     };

[Survived] ObjectLiteral
components/Voice/VoiceCommands.tsx:369:50
         onSubmit: (data: Omit<VoiceCommand, "id" | "usageCount">) => void;
         onCancel: () => void;
     }> = ({ command, onSubmit, onCancel }) => {
-        const [formData, setFormData] = useState({
-            phrase: command?.phrase || "",
-            action: command?.action || "",
-            description: command?.description || "",
-            enabled: command?.enabled ?? true,
-            confidenceThreshold: command?.confidenceThreshold || 0.7,
-            parameters: command?.parameters
-                ? JSON.stringify(command.parameters, null, 2)
-                : "",
-        });
+        const [formData, setFormData] = useState({});
 
         const handleSubmit = (e: React.FormEvent) => {

[Killed] OptionalChaining
components/Voice/VoiceCommands.tsx:370:21
         onCancel: () => void;
     }> = ({ command, onSubmit, onCancel }) => {
         const [formData, setFormData] = useState({
-            phrase: command?.phrase || "",
+            phrase: command.phrase || "",
             action: command?.action || "",
             description: command?.description || "",
killedBy: VoiceCommands calls onCommandCreate when command is created
statusReason: TypeError: Cannot read properties of undefined (reading 'phrase')

[Survived] LogicalOperator
components/Voice/VoiceCommands.tsx:370:21
         onCancel: () => void;
     }> = ({ command, onSubmit, onCancel }) => {
         const [formData, setFormData] = useState({
-            phrase: command?.phrase || "",
+            phrase: command?.phrase && "",
             action: command?.action || "",
             description: command?.description || "",

[Killed] OptionalChaining
components/Voice/VoiceCommands.tsx:371:21
     }> = ({ command, onSubmit, onCancel }) => {
         const [formData, setFormData] = useState({
             phrase: command?.phrase || "",
-            action: command?.action || "",
+            action: command.action || "",
             description: command?.description || "",
             enabled: command?.enabled ?? true,
killedBy: VoiceCommands calls onCommandCreate when command is created
statusReason: TypeError: Cannot read properties of undefined (reading 'action')

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:371:21
     }> = ({ command, onSubmit, onCancel }) => {
         const [formData, setFormData] = useState({
             phrase: command?.phrase || "",
-            action: command?.action || "",
+            action: false,
             description: command?.description || "",
             enabled: command?.enabled ?? true,

[Killed] OptionalChaining
components/Voice/VoiceCommands.tsx:372:26
         const [formData, setFormData] = useState({
             phrase: command?.phrase || "",
             action: command?.action || "",
-            description: command?.description || "",
+            description: command.description || "",
             enabled: command?.enabled ?? true,
             confidenceThreshold: command?.confidenceThreshold || 0.7,
killedBy: VoiceCommands calls onCommandCreate when command is created
statusReason: TypeError: Cannot read properties of undefined (reading 'description')

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:372:26
         const [formData, setFormData] = useState({
             phrase: command?.phrase || "",
             action: command?.action || "",
-            description: command?.description || "",
+            description: true,
             enabled: command?.enabled ?? true,
             confidenceThreshold: command?.confidenceThreshold || 0.7,

[Killed] OptionalChaining
components/Voice/VoiceCommands.tsx:373:22
             phrase: command?.phrase || "",
             action: command?.action || "",
             description: command?.description || "",
-            enabled: command?.enabled ?? true,
+            enabled: command.enabled ?? true,
             confidenceThreshold: command?.confidenceThreshold || 0.7,
             parameters: command?.parameters
killedBy: VoiceCommands calls onCommandCreate when command is created
statusReason: TypeError: Cannot read properties of undefined (reading 'enabled')

[Survived] LogicalOperator
components/Voice/VoiceCommands.tsx:373:22
             phrase: command?.phrase || "",
             action: command?.action || "",
             description: command?.description || "",
-            enabled: command?.enabled ?? true,
+            enabled: command?.enabled && true,
             confidenceThreshold: command?.confidenceThreshold || 0.7,
             parameters: command?.parameters

[Killed] OptionalChaining
components/Voice/VoiceCommands.tsx:374:34
             action: command?.action || "",
             description: command?.description || "",
             enabled: command?.enabled ?? true,
-            confidenceThreshold: command?.confidenceThreshold || 0.7,
+            confidenceThreshold: command.confidenceThreshold || 0.7,
             parameters: command?.parameters
                 ? JSON.stringify(command.parameters, null, 2)
killedBy: VoiceCommands calls onCommandCreate when command is created
statusReason: TypeError: Cannot read properties of undefined (reading 'confidenceThreshold')

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:374:34
             action: command?.action || "",
             description: command?.description || "",
             enabled: command?.enabled ?? true,
-            confidenceThreshold: command?.confidenceThreshold || 0.7,
+            confidenceThreshold: false,
             parameters: command?.parameters
                 ? JSON.stringify(command.parameters, null, 2)

[Killed] OptionalChaining
components/Voice/VoiceCommands.tsx:375:25
             description: command?.description || "",
             enabled: command?.enabled ?? true,
             confidenceThreshold: command?.confidenceThreshold || 0.7,
-            parameters: command?.parameters
+            parameters: command.parameters
                 ? JSON.stringify(command.parameters, null, 2)
                 : "",
killedBy: VoiceCommands calls onCommandCreate when command is created
statusReason: TypeError: Cannot read properties of undefined (reading 'parameters')

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:377:19
             confidenceThreshold: command?.confidenceThreshold || 0.7,
             parameters: command?.parameters
                 ? JSON.stringify(command.parameters, null, 2)
-                : "",
+                : "Stryker was here!",
         });
 

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:380:54
                 : "",
         });
 
-        const handleSubmit = (e: React.FormEvent) => {
-            e.preventDefault();
-            try {
-                const parameters = formData.parameters
-                    ? JSON.parse(formData.parameters)
-                    : undefined;
-
-                onSubmit({
-                    phrase: formData.phrase,
-                    action: formData.action,
-                    description: formData.description,
-                    enabled: formData.enabled,
-                    confidenceThreshold: formData.confidenceThreshold,
-                    parameters,
-                });
-            } catch (error) {
-                toast({
-                    title: "Invalid parameters",
-                    description: "Please check the parameters JSON format",
-                    variant: "error",
-                });
-            }
-        };
+        const handleSubmit = (e: React.FormEvent) => {};
 
         return (

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:382:17
 
         const handleSubmit = (e: React.FormEvent) => {
             e.preventDefault();
-            try {
-                const parameters = formData.parameters
-                    ? JSON.parse(formData.parameters)
-                    : undefined;
-
-                onSubmit({
-                    phrase: formData.phrase,
-                    action: formData.action,
-                    description: formData.description,
-                    enabled: formData.enabled,
-                    confidenceThreshold: formData.confidenceThreshold,
-                    parameters,
-                });
-            } catch (error) {
+            try {} catch (error) {
                 toast({
                     title: "Invalid parameters",
