[Killed] ConditionalExpression
lib/password-validator.ts:111:9
             return 'Weak';
         case 2:
             return 'Fair';
-        case 3:
-            return 'Strong';
+        case 3:
         case 4:
             return 'Very Strong';
killedBy: Password Validator - Traditional Unit Tests Strength labels should return "Strong" for score 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Strong"
Received: "Very Strong"

[Killed] ConditionalExpression
lib/password-validator.ts:113:9
             return 'Fair';
         case 3:
             return 'Strong';
-        case 4:
-            return 'Very Strong';
+        case 4:
         default:
             return 'Unknown';
killedBy: Password Validator - Traditional Unit Tests Strength labels should return "Very Strong" for score 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Very Strong"
Received: "Unknown"

[Killed] ConditionalExpression
lib/password-validator.ts:115:9
             return 'Strong';
         case 4:
             return 'Very Strong';
-        default:
-            return 'Unknown';
+        default:
     }
 }
killedBy: Password Validator - Traditional Unit Tests Strength labels should return "Unknown" for invalid score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Unknown"
Received: undefined

[Killed] BlockStatement
lib/password-validator.ts:120:65
     }
 }
 
-export function getPasswordStrengthColor(score: number): string {
-    switch (score) {
-        case 0:
-            return 'text-red-600';
-        case 1:
-            return 'text-orange-600';
-        case 2:
-            return 'text-yellow-600';
-        case 3:
-            return 'text-green-600';
-        case 4:
-            return 'text-emerald-600';
-        default:
-            return 'text-gray-600';
-    }
-}
+export function getPasswordStrengthColor(score: number): string {}
 
 export function getPasswordStrengthBarColor(score: number): string {
killedBy: Password Validator - Traditional Unit Tests Strength colors should return red-600 for very weak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text-red-600"
Received: undefined

[Killed] ConditionalExpression
lib/password-validator.ts:122:9
 
 export function getPasswordStrengthColor(score: number): string {
     switch (score) {
-        case 0:
-            return 'text-red-600';
+        case 0:
         case 1:
             return 'text-orange-600';
killedBy: Password Validator - Traditional Unit Tests Strength colors should return red-600 for very weak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text-red-600"
Received: "text-orange-600"

[Killed] ConditionalExpression
lib/password-validator.ts:124:9
     switch (score) {
         case 0:
             return 'text-red-600';
-        case 1:
-            return 'text-orange-600';
+        case 1:
         case 2:
             return 'text-yellow-600';
killedBy: Password Validator - Traditional Unit Tests Strength colors should return orange-600 for weak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text-orange-600"
Received: "text-yellow-600"

[Killed] ConditionalExpression
lib/password-validator.ts:126:9
             return 'text-red-600';
         case 1:
             return 'text-orange-600';
-        case 2:
-            return 'text-yellow-600';
+        case 2:
         case 3:
             return 'text-green-600';
killedBy: Password Validator - Traditional Unit Tests Strength colors should return yellow-600 for fair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text-yellow-600"
Received: "text-green-600"

[Killed] ConditionalExpression
lib/password-validator.ts:128:9
             return 'text-orange-600';
         case 2:
             return 'text-yellow-600';
-        case 3:
-            return 'text-green-600';
+        case 3:
         case 4:
             return 'text-emerald-600';
killedBy: Password Validator - Traditional Unit Tests Strength colors should return green-600 for strong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text-green-600"
Received: "text-emerald-600"

[Killed] ConditionalExpression
lib/password-validator.ts:130:9
             return 'text-yellow-600';
         case 3:
             return 'text-green-600';
-        case 4:
-            return 'text-emerald-600';
+        case 4:
         default:
             return 'text-gray-600';
killedBy: Password Validator - Traditional Unit Tests Strength colors should return emerald-600 for very strong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text-emerald-600"
Received: "text-gray-600"

[Killed] StringLiteral
lib/password-validator.ts:131:20
         case 3:
             return 'text-green-600';
         case 4:
-            return 'text-emerald-600';
+            return "";
         default:
             return 'text-gray-600';
killedBy: Password Validator - Traditional Unit Tests Strength colors should return emerald-600 for very strong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text-emerald-600"
Received: ""

[NoCoverage] ConditionalExpression
lib/password-validator.ts:132:9
             return 'text-green-600';
         case 4:
             return 'text-emerald-600';
-        default:
-            return 'text-gray-600';
+        default:
     }
 }

[NoCoverage] StringLiteral
lib/password-validator.ts:133:20
         case 4:
             return 'text-emerald-600';
         default:
-            return 'text-gray-600';
+            return "";
     }
 }

[Killed] BlockStatement
lib/password-validator.ts:137:68
     }
 }
 
-export function getPasswordStrengthBarColor(score: number): string {
-    switch (score) {
-        case 0:
-            return 'bg-red-500';
-        case 1:
-            return 'bg-orange-500';
-        case 2:
-            return 'bg-yellow-500';
-        case 3:
-            return 'bg-green-500';
-        case 4:
-            return 'bg-emerald-500';
-        default:
-            return 'bg-gray-300';
-    }
-}
+export function getPasswordStrengthBarColor(score: number): string {}
 
killedBy: Password Validator - Traditional Unit Tests Strength bar colors should return red-500 bar for very weak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bg-red-500"
Received: undefined

[Killed] ConditionalExpression
lib/password-validator.ts:139:9
 
 export function getPasswordStrengthBarColor(score: number): string {
     switch (score) {
-        case 0:
-            return 'bg-red-500';
+        case 0:
         case 1:
             return 'bg-orange-500';
killedBy: Password Validator - Traditional Unit Tests Strength bar colors should return red-500 bar for very weak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bg-red-500"
Received: "bg-orange-500"

[Killed] ConditionalExpression
lib/password-validator.ts:141:9
     switch (score) {
         case 0:
             return 'bg-red-500';
-        case 1:
-            return 'bg-orange-500';
+        case 1:
         case 2:
             return 'bg-yellow-500';
killedBy: Password Validator - Traditional Unit Tests Strength bar colors should return orange-500 bar for weak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bg-orange-500"
Received: "bg-yellow-500"

[Killed] ConditionalExpression
lib/password-validator.ts:143:9
             return 'bg-red-500';
         case 1:
             return 'bg-orange-500';
-        case 2:
-            return 'bg-yellow-500';
+        case 2:
         case 3:
             return 'bg-green-500';
killedBy: Password Validator - Traditional Unit Tests Strength bar colors should return yellow-500 bar for fair
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bg-yellow-500"
Received: "bg-green-500"

[Killed] ConditionalExpression
lib/password-validator.ts:145:9
             return 'bg-orange-500';
         case 2:
             return 'bg-yellow-500';
-        case 3:
-            return 'bg-green-500';
+        case 3:
         case 4:
             return 'bg-emerald-500';
killedBy: Password Validator - Traditional Unit Tests Strength bar colors should return green-500 bar for strong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bg-green-500"
Received: "bg-emerald-500"

[Killed] StringLiteral
lib/password-validator.ts:146:20
         case 2:
             return 'bg-yellow-500';
         case 3:
-            return 'bg-green-500';
+            return "";
         case 4:
             return 'bg-emerald-500';
killedBy: Password Validator - Traditional Unit Tests Strength bar colors should return green-500 bar for strong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bg-green-500"
Received: ""

[Killed] ConditionalExpression
lib/password-validator.ts:147:9
             return 'bg-yellow-500';
         case 3:
             return 'bg-green-500';
-        case 4:
-            return 'bg-emerald-500';
+        case 4:
         default:
             return 'bg-gray-300';
killedBy: Password Validator - Traditional Unit Tests Strength bar colors should return emerald-500 bar for very strong
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bg-emerald-500"
Received: "bg-gray-300"

[NoCoverage] ConditionalExpression
lib/password-validator.ts:149:9
             return 'bg-green-500';
         case 4:
             return 'bg-emerald-500';
-        default:
-            return 'bg-gray-300';
+        default:
     }
 }
