[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:395:29
                     confidenceThreshold: formData.confidenceThreshold,
                     parameters,
                 });
-            } catch (error) {
-                toast({
-                    title: "Invalid parameters",
-                    description: "Please check the parameters JSON format",
-                    variant: "error",
-                });
-            }
+            } catch (error) {}
         };
 

[NoCoverage] ObjectLiteral
components/Voice/VoiceCommands.tsx:396:23
                     parameters,
                 });
             } catch (error) {
-                toast({
-                    title: "Invalid parameters",
-                    description: "Please check the parameters JSON format",
-                    variant: "error",
-                });
+                toast({});
             }
         };

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:398:34
             } catch (error) {
                 toast({
                     title: "Invalid parameters",
-                    description: "Please check the parameters JSON format",
+                    description: "",
                     variant: "error",
                 });

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:411:35
                     <Input
                         id="phrase"
                         value={formData.phrase}
-                        onChange={(e) =>
-                            setFormData((prev) => ({ ...prev, phrase: e.target.value }))
+                        onChange={() => undefined
                         }
                         placeholder="e.g., open calendar"

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:412:41
                         id="phrase"
                         value={formData.phrase}
                         onChange={(e) =>
-                            setFormData((prev) => ({ ...prev, phrase: e.target.value }))
+                            setFormData(() => undefined)
                         }
                         placeholder="e.g., open calendar"

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:423:40
                     <Label htmlFor="action">Action</Label>
                     <Select
                         value={formData.action}
-                        onValueChange={(value) =>
-                            setFormData((prev) => ({ ...prev, action: value }))
+                        onValueChange={() => undefined
                         }
                     >

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:424:41
                     <Select
                         value={formData.action}
                         onValueChange={(value) =>
-                            setFormData((prev) => ({ ...prev, action: value }))
+                            setFormData(() => undefined)
                         }
                     >

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:447:35
                     <Input
                         id="description"
                         value={formData.description}
-                        onChange={(e) =>
-                            setFormData((prev) => ({
-                                ...prev,
-                                description: e.target.value,
-                            }))
+                        onChange={() => undefined
                         }
                         placeholder="Describe what this command does"

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:448:41
                         id="description"
                         value={formData.description}
                         onChange={(e) =>
-                            setFormData((prev) => ({
-                                ...prev,
-                                description: e.target.value,
-                            }))
+                            setFormData(() => undefined)
                         }
                         placeholder="Describe what this command does"

[NoCoverage] ObjectLiteral
components/Voice/VoiceCommands.tsx:448:52
                         id="description"
                         value={formData.description}
                         onChange={(e) =>
-                            setFormData((prev) => ({
-                                ...prev,
-                                description: e.target.value,
-                            }))
+                            setFormData((prev) => ({}))
                         }
                         placeholder="Describe what this command does"

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:468:39
                             min="0.1"
                             max="1.0"
                             value={formData.confidenceThreshold}
-                            onChange={(e) =>
-                                setFormData((prev) => ({
-                                    ...prev,
-                                    confidenceThreshold: parseFloat(e.target.value),
-                                }))
+                            onChange={() => undefined
                             }
                         />

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:469:45
                             max="1.0"
                             value={formData.confidenceThreshold}
                             onChange={(e) =>
-                                setFormData((prev) => ({
-                                    ...prev,
-                                    confidenceThreshold: parseFloat(e.target.value),
-                                }))
+                                setFormData(() => undefined)
                             }
                         />

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:481:46
                         <Switch
                             id="enabled"
                             checked={formData.enabled}
-                            onCheckedChange={(checked) =>
-                                setFormData((prev) => ({
-                                    ...prev,
-                                    enabled: checked,
-                                }))
+                            onCheckedChange={() => undefined
                             }
                         />

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:482:45
                             id="enabled"
                             checked={formData.enabled}
                             onCheckedChange={(checked) =>
-                                setFormData((prev) => ({
-                                    ...prev,
-                                    enabled: checked,
-                                }))
+                                setFormData(() => undefined)
                             }
                         />

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:497:35
                     <Textarea
                         id="parameters"
                         value={formData.parameters}
-                        onChange={(e) =>
-                            setFormData((prev) => ({ ...prev, parameters: e.target.value }))
+                        onChange={() => undefined
                         }
                         placeholder='{"key": "value"}'

[NoCoverage] ArrowFunction
components/Voice/VoiceCommands.tsx:498:41
                         id="parameters"
                         value={formData.parameters}
                         onChange={(e) =>
-                            setFormData((prev) => ({ ...prev, parameters: e.target.value }))
+                            setFormData(() => undefined)
                         }
                         placeholder='{"key": "value"}'

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:519:28
     };
 
     return (
-        <div className={cn("space-y-6", compactView ? "p-2" : "p-6")}>
+        <div className={cn("", compactView ? "p-2" : "p-6")}>
             {/* Header */}
             {showNavigation && (

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:519:55
     };
 
     return (
-        <div className={cn("space-y-6", compactView ? "p-2" : "p-6")}>
+        <div className={cn("space-y-6", compactView ? "" : "p-6")}>
             {/* Header */}
             {showNavigation && (

[Survived] BooleanLiteral
components/Voice/VoiceCommands.tsx:530:61
                         <Button
                             variant="outline"
                             size={compactView ? "sm" : "default"}
-                            onClick={() => setIsResultsOpen(true)}
+                            onClick={() => setIsResultsOpen(false)}
                         >
                             View Results ({recognitionResults.length})

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:530:38
                         <Button
                             variant="outline"
                             size={compactView ? "sm" : "default"}
-                            onClick={() => setIsResultsOpen(true)}
+                            onClick={() => undefined}
                         >
                             View Results ({recognitionResults.length})

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:541:61
                                     <DialogTitle>Recognition Results</DialogTitle>
                                 </DialogHeader>
                                 <div className="space-y-2">
-                                    {recognitionResults.map((result) => (
-                                        <Card key={result.id} className="p-4">
-                                            <div className="flex justify-between items-start">
-                                                <div>
-                                                    <p className="font-medium">"{result.transcript}"</p>
-                                                    <p className="text-sm text-gray-500">{result.timestamp.toLocaleTimeString()}</p>
-                                                </div>
-                                                <Badge variant={result.processed ? "default" : "secondary"}>
-                                                    {Math.round(result.confidence * 100)}%
-                                                </Badge>
-                                            </div>
-                                        </Card>
-                                    ))}
+                                    {recognitionResults.map(() => undefined)}
                                     {recognitionResults.length === 0 && (
                                         <p className="text-center text-gray-500">No results yet.</p>

[NoCoverage] ArithmeticOperator
components/Voice/VoiceCommands.tsx:549:65
                                                     <p className="text-sm text-gray-500">{result.timestamp.toLocaleTimeString()}</p>
                                                 </div>
                                                 <Badge variant={result.processed ? "default" : "secondary"}>
-                                                    {Math.round(result.confidence * 100)}%
+                                                    {Math.round(result.confidence / 100)}%
                                                 </Badge>
                                             </div>

[Survived] LogicalOperator
components/Voice/VoiceCommands.tsx:554:38
                                             </div>
                                         </Card>
                                     ))}
-                                    {recognitionResults.length === 0 && (
-                                        <p className="text-center text-gray-500">No results yet.</p>
-                                    )}
+                                    {recognitionResults.length === 0 || <p className="text-center text-gray-500">No results yet.</p>}
                                 </div>
                             </DialogContent>

[Survived] EqualityOperator
components/Voice/VoiceCommands.tsx:554:38
                                             </div>
                                         </Card>
                                     ))}
-                                    {recognitionResults.length === 0 && (
+                                    {recognitionResults.length !== 0 && (
                                         <p className="text-center text-gray-500">No results yet.</p>
                                     )}

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:564:53
                         {isListening ? (
                             <Button
                                 variant="destructive"
-                                size={compactView ? "sm" : "default"}
+                                size={compactView ? "" : "default"}
                                 onClick={stopListening}
                                 className="gap-2"

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:564:60
                         {isListening ? (
                             <Button
                                 variant="destructive"
-                                size={compactView ? "sm" : "default"}
+                                size={compactView ? "sm" : ""}
                                 onClick={stopListening}
                                 className="gap-2"

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:574:53
                         ) : (
                             <Button
                                 variant="default"
-                                size={compactView ? "sm" : "default"}
+                                size={compactView ? "" : "default"}
                                 onClick={startListening}
                                 disabled={isProcessing}

[Survived] BlockStatement
components/Voice/VoiceCommands.tsx:587:44
                         <Button
                             variant="outline"
                             size={compactView ? "sm" : "default"}
-                            onClick={() => {
-                                setSelectedCommand(null);
-                                setIsCommandModalOpen(true);
-                            }}
+                            onClick={() => {}}
                             className="gap-2"
                         >

[Survived] BooleanLiteral
components/Voice/VoiceCommands.tsx:589:55
                             size={compactView ? "sm" : "default"}
                             onClick={() => {
                                 setSelectedCommand(null);
-                                setIsCommandModalOpen(true);
+                                setIsCommandModalOpen(false);
                             }}
                             className="gap-2"

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:601:60
                             <DialogContent>
                                 <DialogHeader>
                                     <DialogTitle>
-                                        {selectedCommand ? "Edit Command" : "Create Command"}
+                                        {selectedCommand ? "" : "Create Command"}
                                     </DialogTitle>
                                 </DialogHeader>

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:605:46
                                     </DialogTitle>
                                 </DialogHeader>
                                 <CommandForm
-                                    command={selectedCommand || undefined}
+                                    command={true}
                                     onSubmit={(data) => {
                                         if (selectedCommand) {

[Survived] LogicalOperator
components/Voice/VoiceCommands.tsx:605:46
                                     </DialogTitle>
                                 </DialogHeader>
                                 <CommandForm
-                                    command={selectedCommand || undefined}
+                                    command={selectedCommand && undefined}
                                     onSubmit={(data) => {
                                         if (selectedCommand) {

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:606:57
                                 </DialogHeader>
                                 <CommandForm
                                     command={selectedCommand || undefined}
-                                    onSubmit={(data) => {
-                                        if (selectedCommand) {
-                                            handleUpdateCommand(selectedCommand.id, data);
-                                        } else {
-                                            handleCreateCommand(data);
-                                        }
-                                    }}
+                                    onSubmit={(data) => {}}
                                     onCancel={() => setIsCommandModalOpen(false)}
                                 />

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:607:45
                                 <CommandForm
                                     command={selectedCommand || undefined}
                                     onSubmit={(data) => {
-                                        if (selectedCommand) {
+                                        if (true) {
                                             handleUpdateCommand(selectedCommand.id, data);
                                         } else {

[NoCoverage] ConditionalExpression
components/Voice/VoiceCommands.tsx:607:45
                                 <CommandForm
                                     command={selectedCommand || undefined}
                                     onSubmit={(data) => {
-                                        if (selectedCommand) {
+                                        if (false) {
                                             handleUpdateCommand(selectedCommand.id, data);
                                         } else {

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:609:48
                                     onSubmit={(data) => {
                                         if (selectedCommand) {
                                             handleUpdateCommand(selectedCommand.id, data);
-                                        } else {
-                                            handleCreateCommand(data);
-                                        }
+                                        } else {}
                                     }}
                                     onCancel={() => setIsCommandModalOpen(false)}

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:613:47
                                             handleCreateCommand(data);
                                         }
                                     }}
-                                    onCancel={() => setIsCommandModalOpen(false)}
+                                    onCancel={() => undefined}
                                 />
                             </DialogContent>

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:613:75
                                             handleCreateCommand(data);
                                         }
                                     }}
-                                    onCancel={() => setIsCommandModalOpen(false)}
+                                    onCancel={() => setIsCommandModalOpen(true)}
                                 />
                             </DialogContent>

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:629:84
                     </CardTitle>
                 </CardHeader>
                 <CardContent>
-                    <div className={cn("grid gap-4", compactView ? "grid-cols-1" : "grid-cols-3")}>
+                    <div className={cn("grid gap-4", compactView ? "grid-cols-1" : "")}>
                         <div className="flex flex-col items-center space-y-2">
                             <Badge

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:633:110
                         <div className="flex flex-col items-center space-y-2">
                             <Badge
                                 variant={isListening ? "default" : "secondary"}
-                                className={cn("px-3 py-1", isListening ? "bg-green-500 hover:bg-green-600" : "")}
+                                className={cn("px-3 py-1", isListening ? "bg-green-500 hover:bg-green-600" : "Stryker was here!")}
                             >
                                 {isListening ? "Listening" : "Inactive"}

[Survived] ArithmeticOperator
components/Voice/VoiceCommands.tsx:641:46
                         </div>
 
                         <div className="flex flex-col items-center space-y-2 w-full">
-                            <Progress value={confidence * 100} className="w-full" />
+                            <Progress value={confidence / 100} className="w-full" />
                             <span className="text-sm text-gray-500">
                                 Confidence: {Math.round(confidence * 100)}%

[Survived] ArithmeticOperator
components/Voice/VoiceCommands.tsx:643:57
                         <div className="flex flex-col items-center space-y-2 w-full">
                             <Progress value={confidence * 100} className="w-full" />
                             <span className="text-sm text-gray-500">
-                                Confidence: {Math.round(confidence * 100)}%
+                                Confidence: {Math.round(confidence / 100)}%
                             </span>
                         </div>

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:648:49
                         </div>
 
                         <div className="flex flex-col items-center space-y-2">
-                            <span className={cn("font-bold", compactView ? "text-xl" : "text-2xl")}>
+                            <span className={cn("", compactView ? "text-xl" : "text-2xl")}>
                                 {commands.filter((c) => c.enabled).length}
                             </span>

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:648:76
                         </div>
 
                         <div className="flex flex-col items-center space-y-2">
-                            <span className={cn("font-bold", compactView ? "text-xl" : "text-2xl")}>
+                            <span className={cn("font-bold", compactView ? "" : "text-2xl")}>
                                 {commands.filter((c) => c.enabled).length}
                             </span>

[Killed] ArrowFunction
components/Voice/VoiceCommands.tsx:649:50
 
                         <div className="flex flex-col items-center space-y-2">
                             <span className={cn("font-bold", compactView ? "text-xl" : "text-2xl")}>
-                                {commands.filter((c) => c.enabled).length}
+                                {commands.filter(() => undefined).length}
                             </span>
                             <span className="text-sm text-gray-500">Active Commands</span>
killedBy: VoiceCommands displays voice recognition status correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] MethodExpression
components/Voice/VoiceCommands.tsx:649:34
 
                         <div className="flex flex-col items-center space-y-2">
                             <span className={cn("font-bold", compactView ? "text-xl" : "text-2xl")}>
-                                {commands.filter((c) => c.enabled).length}
+                                {commands.length}
                             </span>
                             <span className="text-sm text-gray-500">Active Commands</span>
killedBy: VoiceCommands handles disabled command correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: 0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] LogicalOperator
components/Voice/VoiceCommands.tsx:655:22
                         </div>
                     </div>
 
-                    {currentTranscript && (
-                        <Alert className="mt-4 bg-blue-50 dark:bg-blue-900/20 border-blue-200 dark:border-blue-800">
-                            <Info className="h-4 w-4" />
-                            <AlertTitle>Current Input</AlertTitle>
-                            <AlertDescription>{currentTranscript}</AlertDescription>
-                        </Alert>
-                    )}
+                    {currentTranscript || <Alert className="mt-4 bg-blue-50 dark:bg-blue-900/20 border-blue-200 dark:border-blue-800">
+                            <Info className="h-4 w-4" />
+                            <AlertTitle>Current Input</AlertTitle>
+                            <AlertDescription>{currentTranscript}</AlertDescription>
+                        </Alert>}
                 </CardContent>
             </Card>

[Survived] ConditionalExpression
components/Voice/VoiceCommands.tsx:655:22
                         </div>
                     </div>
 
-                    {currentTranscript && (
-                        <Alert className="mt-4 bg-blue-50 dark:bg-blue-900/20 border-blue-200 dark:border-blue-800">
-                            <Info className="h-4 w-4" />
-                            <AlertTitle>Current Input</AlertTitle>
-                            <AlertDescription>{currentTranscript}</AlertDescription>
-                        </Alert>
-                    )}
+                    {true}
                 </CardContent>
             </Card>

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:668:72
             {/* Available Commands */}
             <Card>
                 <CardHeader>
-                    <CardTitle className={cn(compactView ? "text-lg" : "text-xl")}>
+                    <CardTitle className={cn(compactView ? "text-lg" : "")}>
                         Available Commands ({commands.filter((c) => c.enabled).length})
                     </CardTitle>

[Killed] ArrowFunction
components/Voice/VoiceCommands.tsx:669:62
             <Card>
                 <CardHeader>
                     <CardTitle className={cn(compactView ? "text-lg" : "text-xl")}>
-                        Available Commands ({commands.filter((c) => c.enabled).length})
+                        Available Commands ({commands.filter(() => undefined).length})
                     </CardTitle>
                 </CardHeader>
killedBy: VoiceCommands shows available commands
statusReason: TestingLibraryElementError: Unable to find an element with the text: Available Commands (1). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] MethodExpression
components/Voice/VoiceCommands.tsx:669:46
             <Card>
                 <CardHeader>
                     <CardTitle className={cn(compactView ? "text-lg" : "text-xl")}>
-                        Available Commands ({commands.filter((c) => c.enabled).length})
+                        Available Commands ({commands.length})
                     </CardTitle>
                 </CardHeader>
killedBy: VoiceCommands handles disabled commands correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Available Commands (0). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] MethodExpression
components/Voice/VoiceCommands.tsx:674:26
                 </CardHeader>
                 <CardContent>
                     <div className={cn("grid gap-4", compactView ? "grid-cols-1" : "grid-cols-2")}>
-                        {commands
-                            .filter((command) => command.enabled)
+                        {commands
                             .map((command) => (
                                 <Card key={command.id} className="p-4">
