[Killed] ArrowFunction
components/Voice/VoiceCommands.tsx:675:37
                 <CardContent>
                     <div className={cn("grid gap-4", compactView ? "grid-cols-1" : "grid-cols-2")}>
                         {commands
-                            .filter((command) => command.enabled)
+                            .filter(() => undefined)
                             .map((command) => (
                                 <Card key={command.id} className="p-4">
killedBy: VoiceCommands shows available commands
statusReason: TestingLibraryElementError: Unable to find an element with the text: "open calendar". This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:683:95
                                             <p className="font-medium">"{command.phrase}"</p>
                                             <p className="text-sm text-gray-500">{command.description}</p>
                                             <div className="flex items-center space-x-2">
-                                                <Badge variant={command.enabled ? "default" : "secondary"} className={command.enabled ? "bg-green-500 hover:bg-green-600" : ""}>
+                                                <Badge variant={command.enabled ? "default" : ""} className={command.enabled ? "bg-green-500 hover:bg-green-600" : ""}>
                                                     {command.enabled ? "Enabled" : "Disabled"}
                                                 </Badge>

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:683:137
                                             <p className="font-medium">"{command.phrase}"</p>
                                             <p className="text-sm text-gray-500">{command.description}</p>
                                             <div className="flex items-center space-x-2">
-                                                <Badge variant={command.enabled ? "default" : "secondary"} className={command.enabled ? "bg-green-500 hover:bg-green-600" : ""}>
+                                                <Badge variant={command.enabled ? "default" : "secondary"} className={command.enabled ? "" : ""}>
                                                     {command.enabled ? "Enabled" : "Disabled"}
                                                 </Badge>

[Killed] StringLiteral
components/Voice/VoiceCommands.tsx:684:72
                                             <p className="text-sm text-gray-500">{command.description}</p>
                                             <div className="flex items-center space-x-2">
                                                 <Badge variant={command.enabled ? "default" : "secondary"} className={command.enabled ? "bg-green-500 hover:bg-green-600" : ""}>
-                                                    {command.enabled ? "Enabled" : "Disabled"}
+                                                    {command.enabled ? "" : "Disabled"}
                                                 </Badge>
                                                 <span className="text-xs text-gray-500">
killedBy: VoiceCommands shows enabled badge for enabled commands
statusReason: TestingLibraryElementError: Unable to find an element with the text: Enabled. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:695:58
                                             <Button
                                                 variant="ghost"
                                                 size="icon"
-                                                onClick={() => toggleCommandEnabled(command.id)}
+                                                onClick={() => undefined}
                                                 className={command.enabled ? "text-green-600" : "text-yellow-600"}
                                             >

[Survived] StringLiteral
components/Voice/VoiceCommands.tsx:696:78
                                                 variant="ghost"
                                                 size="icon"
                                                 onClick={() => toggleCommandEnabled(command.id)}
-                                                className={command.enabled ? "text-green-600" : "text-yellow-600"}
+                                                className={command.enabled ? "" : "text-yellow-600"}
                                             >
                                                 {command.enabled ? (

[NoCoverage] StringLiteral
components/Voice/VoiceCommands.tsx:696:97
                                                 variant="ghost"
                                                 size="icon"
                                                 onClick={() => toggleCommandEnabled(command.id)}
-                                                className={command.enabled ? "text-green-600" : "text-yellow-600"}
+                                                className={command.enabled ? "text-green-600" : ""}
                                             >
                                                 {command.enabled ? (

[NoCoverage] BlockStatement
components/Voice/VoiceCommands.tsx:707:64
                                             <Button
                                                 variant="ghost"
                                                 size="icon"
-                                                onClick={() => {
-                                                    setSelectedCommand(command);
-                                                    setIsCommandModalOpen(true);
-                                                }}
+                                                onClick={() => {}}
                                             >
                                                 <Settings className="w-4 h-4" />

[NoCoverage] BooleanLiteral
components/Voice/VoiceCommands.tsx:709:75
                                                 size="icon"
                                                 onClick={() => {
                                                     setSelectedCommand(command);
-                                                    setIsCommandModalOpen(true);
+                                                    setIsCommandModalOpen(false);
                                                 }}
                                             >

[Survived] ArrowFunction
components/Voice/VoiceCommands.tsx:717:58
                                             <Button
                                                 variant="ghost"
                                                 size="icon"
-                                                onClick={() => handleDeleteCommand(command.id)}
+                                                onClick={() => undefined}
                                                 className="text-red-600 hover:text-red-700 hover:bg-red-50"
                                             >
