[Survived] BooleanLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:96:50
 }
 
 const WhatsAppBusinessIntegration: React.FC = () => {
-  const [isConnected, setIsConnected] = useState(false);
+  const [isConnected, setIsConnected] = useState(true);
   const [isLoading, setIsLoading] = useState(true);
   const [conversations, setConversations] = useState<WhatsAppConversation[]>([]);

[Survived] BooleanLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:97:46
 
 const WhatsAppBusinessIntegration: React.FC = () => {
   const [isConnected, setIsConnected] = useState(false);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
   const [conversations, setConversations] = useState<WhatsAppConversation[]>([]);
   const [messages, setMessages] = useState<WhatsAppMessage[]>([]);

[Survived] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:102:48
   const [messages, setMessages] = useState<WhatsAppMessage[]>([]);
   const [analytics, setAnalytics] = useState<WhatsAppAnalytics | null>(null);
   const [selectedConversation, setSelectedConversation] = useState<WhatsAppConversation | null>(null);
-  const [newMessage, setNewMessage] = useState('');
+  const [newMessage, setNewMessage] = useState("Stryker was here!");
   const [isComposeOpen, setIsComposeOpen] = useState(false);
   const { toast } = useToast();

[Survived] BooleanLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:103:54
   const [analytics, setAnalytics] = useState<WhatsAppAnalytics | null>(null);
   const [selectedConversation, setSelectedConversation] = useState<WhatsAppConversation | null>(null);
   const [newMessage, setNewMessage] = useState('');
-  const [isComposeOpen, setIsComposeOpen] = useState(false);
+  const [isComposeOpen, setIsComposeOpen] = useState(true);
   const { toast } = useToast();
 

[Timeout] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:106:19
   const [isComposeOpen, setIsComposeOpen] = useState(false);
   const { toast } = useToast();
 
-  useEffect(() => {
-    fetchWhatsAppData();
-    const interval = setInterval(fetchConversations, 30000);
-    return () => clearInterval(interval);
-  }, []);
+  useEffect(() => {}, []);
 
   const fetchWhatsAppData = async () => {

[Survived] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:109:12
   useEffect(() => {
     fetchWhatsAppData();
     const interval = setInterval(fetchConversations, 30000);
-    return () => clearInterval(interval);
+    return () => undefined;
   }, []);
 

[Survived] ArrayDeclaration
components/integrations/WhatsAppBusinessIntegration.tsx:110:6
     fetchWhatsAppData();
     const interval = setInterval(fetchConversations, 30000);
     return () => clearInterval(interval);
-  }, []);
+  }, ["Stryker was here"]);
 
   const fetchWhatsAppData = async () => {

[Timeout] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:112:41
     return () => clearInterval(interval);
   }, []);
 
-  const fetchWhatsAppData = async () => {
-    try {
-      setIsLoading(true);
-      const healthResponse = await fetch('/api/whatsapp/health');
-      const healthData = await healthResponse.json();
-      const isHealthy = healthData.status === 'healthy';
-      setIsConnected(isHealthy);
-
-      if (isHealthy) {
-        await Promise.all([
-          fetchConversations(),
-          fetchAnalytics(),
-        ]);
-      }
-    } catch (error) {
-      console.error('Error fetching WhatsApp data:', error);
-      toast({
-        title: 'Error',
-        description: 'Failed to load WhatsApp integration data',
-        variant: 'error',
-      });
-    } finally {
-      setIsLoading(false);
-    }
-  };
+  const fetchWhatsAppData = async () => {};
 
   const fetchConversations = async () => {

[Killed] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:113:9
   }, []);
 
   const fetchWhatsAppData = async () => {
-    try {
-      setIsLoading(true);
-      const healthResponse = await fetch('/api/whatsapp/health');
-      const healthData = await healthResponse.json();
-      const isHealthy = healthData.status === 'healthy';
-      setIsConnected(isHealthy);
-
-      if (isHealthy) {
-        await Promise.all([
-          fetchConversations(),
-          fetchAnalytics(),
-        ]);
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error fetching WhatsApp data:', error);
       toast({
killedBy: WhatsAppBusinessIntegration displays connection status correctly
statusReason: Error: Unable to find an element with the text: Connected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:117:25
       setIsLoading(true);
       const healthResponse = await fetch('/api/whatsapp/health');
       const healthData = await healthResponse.json();
-      const isHealthy = healthData.status === 'healthy';
+      const isHealthy = false;
       setIsConnected(isHealthy);
 
killedBy: WhatsAppBusinessIntegration displays connection status correctly
statusReason: Error: Unable to find an element with the text: Connected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:117:25
       setIsLoading(true);
       const healthResponse = await fetch('/api/whatsapp/health');
       const healthData = await healthResponse.json();
-      const isHealthy = healthData.status === 'healthy';
+      const isHealthy = true;
       setIsConnected(isHealthy);
 
killedBy: WhatsAppBusinessIntegration handles disconnected state correctly
statusReason: Error: Unable to find an element with the text: Disconnected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:120:11
       const isHealthy = healthData.status === 'healthy';
       setIsConnected(isHealthy);
 
-      if (isHealthy) {
+      if (false) {
         await Promise.all([
           fetchConversations(),
killedBy: WhatsAppBusinessIntegration displays analytics overview when connected
statusReason: Error: Unable to find an element with the text: Total Conversations. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:120:22
       const isHealthy = healthData.status === 'healthy';
       setIsConnected(isHealthy);
 
-      if (isHealthy) {
-        await Promise.all([
-          fetchConversations(),
-          fetchAnalytics(),
-        ]);
-      }
+      if (isHealthy) {}
     } catch (error) {
       console.error('Error fetching WhatsApp data:', error);
killedBy: WhatsAppBusinessIntegration displays analytics overview when connected
statusReason: Error: Unable to find an element with the text: Total Conversations. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:126:21
           fetchAnalytics(),
         ]);
       }
-    } catch (error) {
-      console.error('Error fetching WhatsApp data:', error);
-      toast({
-        title: 'Error',
-        description: 'Failed to load WhatsApp integration data',
-        variant: 'error',
-      });
-    } finally {
+    } catch (error) {} finally {
       setIsLoading(false);
     }

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:127:21
         ]);
       }
     } catch (error) {
-      console.error('Error fetching WhatsApp data:', error);
+      console.error("", error);
       toast({
         title: 'Error',

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:131:18
       toast({
         title: 'Error',
         description: 'Failed to load WhatsApp integration data',
-        variant: 'error',
+        variant: "",
       });
     } finally {

[Killed] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:138:42
     }
   };
 
-  const fetchConversations = async () => {
-    try {
-      const response = await fetch('/api/whatsapp/conversations');
-      const data = await response.json();
-      if (data.success) {
-        setConversations(data.conversations);
-      }
-    } catch (error) {
-      console.error('Error fetching conversations:', error);
-    }
-  };
+  const fetchConversations = async () => {};
 
   const fetchMessages = async (whatsappId: string) => {
killedBy: WhatsAppBusinessIntegration displays conversations in conversations tab
statusReason: Error: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:139:9
   };
 
   const fetchConversations = async () => {
-    try {
-      const response = await fetch('/api/whatsapp/conversations');
-      const data = await response.json();
-      if (data.success) {
-        setConversations(data.conversations);
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error fetching conversations:', error);
     }
killedBy: WhatsAppBusinessIntegration displays conversations in conversations tab
statusReason: Error: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:140:36
 
   const fetchConversations = async () => {
     try {
-      const response = await fetch('/api/whatsapp/conversations');
+      const response = await fetch("");
       const data = await response.json();
       if (data.success) {
killedBy: WhatsAppBusinessIntegration displays conversations in conversations tab
statusReason: Error: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:142:11
     try {
       const response = await fetch('/api/whatsapp/conversations');
       const data = await response.json();
-      if (data.success) {
+      if (false) {
         setConversations(data.conversations);
       }
killedBy: WhatsAppBusinessIntegration displays conversations in conversations tab
statusReason: Error: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:142:25
     try {
       const response = await fetch('/api/whatsapp/conversations');
       const data = await response.json();
-      if (data.success) {
-        setConversations(data.conversations);
-      }
+      if (data.success) {}
     } catch (error) {
       console.error('Error fetching conversations:', error);
killedBy: WhatsAppBusinessIntegration displays conversations in conversations tab
statusReason: Error: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:145:21
       if (data.success) {
         setConversations(data.conversations);
       }
-    } catch (error) {
-      console.error('Error fetching conversations:', error);
-    }
+    } catch (error) {}
   };
 

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:150:55
     }
   };
 
-  const fetchMessages = async (whatsappId: string) => {
-    try {
-      const response = await fetch(`/api/whatsapp/messages/${whatsappId}`);
-      const data = await response.json();
-      if (data.success) {
-        setMessages(data.messages);
-      }
-    } catch (error) {
-      console.error('Error fetching messages:', error);
-    }
-  };
+  const fetchMessages = async (whatsappId: string) => {};
 
   const fetchAnalytics = async () => {

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:151:9
   };
 
   const fetchMessages = async (whatsappId: string) => {
-    try {
-      const response = await fetch(`/api/whatsapp/messages/${whatsappId}`);
-      const data = await response.json();
-      if (data.success) {
-        setMessages(data.messages);
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error fetching messages:', error);
     }

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:152:36
 
   const fetchMessages = async (whatsappId: string) => {
     try {
-      const response = await fetch(`/api/whatsapp/messages/${whatsappId}`);
+      const response = await fetch(``);
       const data = await response.json();
       if (data.success) {

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:154:25
     try {
       const response = await fetch(`/api/whatsapp/messages/${whatsappId}`);
       const data = await response.json();
-      if (data.success) {
-        setMessages(data.messages);
-      }
+      if (data.success) {}
     } catch (error) {
       console.error('Error fetching messages:', error);

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:157:21
       if (data.success) {
         setMessages(data.messages);
       }
-    } catch (error) {
-      console.error('Error fetching messages:', error);
-    }
+    } catch (error) {}
   };
 

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:158:21
         setMessages(data.messages);
       }
     } catch (error) {
-      console.error('Error fetching messages:', error);
+      console.error("", error);
     }
   };

[Killed] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:162:38
     }
   };
 
-  const fetchAnalytics = async () => {
-    try {
-      const response = await fetch('/api/whatsapp/analytics');
-      const data = await response.json();
-      if (data.success) {
-        setAnalytics(data.analytics);
-      }
-    } catch (error) {
-      console.error('Error fetching analytics:', error);
-    }
-  };
+  const fetchAnalytics = async () => {};
 
   const handleSendMessage = async () => {
killedBy: WhatsAppBusinessIntegration displays analytics overview when connected
statusReason: Error: Unable to find an element with the text: Total Conversations. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:163:9
   };
 
   const fetchAnalytics = async () => {
-    try {
-      const response = await fetch('/api/whatsapp/analytics');
-      const data = await response.json();
-      if (data.success) {
-        setAnalytics(data.analytics);
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error fetching analytics:', error);
     }
killedBy: WhatsAppBusinessIntegration displays analytics overview when connected
statusReason: Error: Unable to find an element with the text: Total Conversations. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:166:25
     try {
       const response = await fetch('/api/whatsapp/analytics');
       const data = await response.json();
-      if (data.success) {
-        setAnalytics(data.analytics);
-      }
+      if (data.success) {}
     } catch (error) {
       console.error('Error fetching analytics:', error);
killedBy: WhatsAppBusinessIntegration displays analytics overview when connected
statusReason: Error: Unable to find an element with the text: Total Conversations. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:169:21
       if (data.success) {
         setAnalytics(data.analytics);
       }
-    } catch (error) {
-      console.error('Error fetching analytics:', error);
-    }
+    } catch (error) {}
   };
 

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:170:21
         setAnalytics(data.analytics);
       }
     } catch (error) {
-      console.error('Error fetching analytics:', error);
+      console.error("", error);
     }
   };

[NoCoverage] BooleanLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:175:31
   };
 
   const handleSendMessage = async () => {
-    if (!newMessage.trim() || !selectedConversation) return;
+    if (!newMessage.trim() || selectedConversation) return;
 
     try {

[NoCoverage] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:175:9
   };
 
   const handleSendMessage = async () => {
-    if (!newMessage.trim() || !selectedConversation) return;
+    if (false) return;
 
     try {

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:177:9
   const handleSendMessage = async () => {
     if (!newMessage.trim() || !selectedConversation) return;
 
-    try {
-      const response = await fetch('/api/whatsapp/send', {
-        method: 'POST',
-        headers: { 'Content-Type': 'application/json' },
-        body: JSON.stringify({
-          to: selectedConversation.whatsapp_id,
-          type: 'text',
-          content: { body: newMessage },
-        }),
-      });
-
-      const result = await response.json();
-      if (result.success) {
-        toast({
-          title: 'Message Sent',
-          description: 'Your WhatsApp message has been sent successfully',
-        });
-        setNewMessage('');
-        fetchMessages(selectedConversation.whatsapp_id);
-      }
-    } catch (error) {
+    try {} catch (error) {
       toast({
         title: 'Send Failed',

[NoCoverage] ObjectLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:178:58
     if (!newMessage.trim() || !selectedConversation) return;
 
     try {
-      const response = await fetch('/api/whatsapp/send', {
-        method: 'POST',
-        headers: { 'Content-Type': 'application/json' },
-        body: JSON.stringify({
-          to: selectedConversation.whatsapp_id,
-          type: 'text',
-          content: { body: newMessage },
-        }),
-      });
+      const response = await fetch('/api/whatsapp/send', {});
 
       const result = await response.json();

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:179:17
 
     try {
       const response = await fetch('/api/whatsapp/send', {
-        method: 'POST',
+        method: "",
         headers: { 'Content-Type': 'application/json' },
         body: JSON.stringify({

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:183:17
         headers: { 'Content-Type': 'application/json' },
         body: JSON.stringify({
           to: selectedConversation.whatsapp_id,
-          type: 'text',
+          type: "",
           content: { body: newMessage },
         }),

[NoCoverage] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:189:11
       });
 
       const result = await response.json();
-      if (result.success) {
+      if (false) {
         toast({
           title: 'Message Sent',

[NoCoverage] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:189:11
       });
 
       const result = await response.json();
-      if (result.success) {
+      if (true) {
         toast({
           title: 'Message Sent',

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:191:18
       const result = await response.json();
       if (result.success) {
         toast({
-          title: 'Message Sent',
+          title: "",
           description: 'Your WhatsApp message has been sent successfully',
         });

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:192:24
       if (result.success) {
         toast({
           title: 'Message Sent',
-          description: 'Your WhatsApp message has been sent successfully',
+          description: "",
         });
         setNewMessage('');

[NoCoverage] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:194:23
           title: 'Message Sent',
           description: 'Your WhatsApp message has been sent successfully',
         });
-        setNewMessage('');
+        setNewMessage("Stryker was here!");
         fetchMessages(selectedConversation.whatsapp_id);
       }

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:197:21
         setNewMessage('');
         fetchMessages(selectedConversation.whatsapp_id);
       }
-    } catch (error) {
-      toast({
-        title: 'Send Failed',
-        description: 'An error occurred while sending the message',
-        variant: 'error',
-      });
-    }
+    } catch (error) {}
   };
 

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:206:76
     }
   };
 
-  const handleConversationSelect = (conversation: WhatsAppConversation) => {
-    setSelectedConversation(conversation);
-    fetchMessages(conversation.whatsapp_id);
-  };
+  const handleConversationSelect = (conversation: WhatsAppConversation) => {};
 
   if (isLoading) {

[Killed] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:211:18
     fetchMessages(conversation.whatsapp_id);
   };
 
-  if (isLoading) {
-    return (
-      <div className="flex flex-col items-center justify-center py-8">
-        <RefreshCw className="h-12 w-12 animate-spin text-blue-500" />
-        <p className="mt-4 text-muted-foreground">Loading WhatsApp Business integration...</p>
-      </div>
-    );
-  }
+  if (isLoading) {}
 
   return (
killedBy: WhatsAppBusinessIntegration opens compose message modal
statusReason: Error: Unable to find an element with the text: Compose New Message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:232:48
         </div>
         <div className="flex gap-2 items-center">
           <Badge
-            variant={isConnected ? "default" : "destructive"}
+            variant={isConnected ? "default" : ""}
             className={isConnected ? "bg-green-500 hover:bg-green-600" : ""}
           >

[Survived] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:233:38
         <div className="flex gap-2 items-center">
           <Badge
             variant={isConnected ? "default" : "destructive"}
-            className={isConnected ? "bg-green-500 hover:bg-green-600" : ""}
+            className={isConnected ? "" : ""}
           >
             {isConnected ? 'Connected' : 'Disconnected'}

[Survived] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:233:74
         <div className="flex gap-2 items-center">
           <Badge
             variant={isConnected ? "default" : "destructive"}
-            className={isConnected ? "bg-green-500 hover:bg-green-600" : ""}
+            className={isConnected ? "bg-green-500 hover:bg-green-600" : "Stryker was here!"}
           >
             {isConnected ? 'Connected' : 'Disconnected'}

[Killed] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:235:28
             variant={isConnected ? "default" : "destructive"}
             className={isConnected ? "bg-green-500 hover:bg-green-600" : ""}
           >
-            {isConnected ? 'Connected' : 'Disconnected'}
+            {isConnected ? "" : 'Disconnected'}
           </Badge>
           <Button variant="outline" size="sm">
killedBy: WhatsAppBusinessIntegration displays connection status correctly
statusReason: Error: Unable to find an element with the text: Connected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] BooleanLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:242:23
             Configure
           </Button>
           <Button
-            disabled={!isConnected}
+            disabled={isConnected}
             onClick={() => setIsComposeOpen(true)}
           >
killedBy: WhatsAppBusinessIntegration opens compose message modal
statusReason: Error: Unable to find an element with the text: Compose New Message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:243:22
           </Button>
           <Button
             disabled={!isConnected}
-            onClick={() => setIsComposeOpen(true)}
+            onClick={() => undefined}
           >
             <PlusSquare className="mr-2 h-4 w-4" />
killedBy: WhatsAppBusinessIntegration opens compose message modal
statusReason: Error: Unable to find an element with the text: Compose New Message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] BooleanLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:243:45
           </Button>
           <Button
             disabled={!isConnected}
-            onClick={() => setIsComposeOpen(true)}
+            onClick={() => setIsComposeOpen(false)}
           >
             <PlusSquare className="mr-2 h-4 w-4" />
killedBy: WhatsAppBusinessIntegration opens compose message modal
statusReason: Error: Unable to find an element with the text: Compose New Message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="chakra-provider"
    >

[Survived] MethodExpression
components/integrations/WhatsAppBusinessIntegration.tsx:280:18
             </CardHeader>
             <CardContent>
               <p className="text-3xl font-bold">
-                {analytics.message_statistics
-                  .filter(m => m.direction === 'outbound')
+                {analytics.message_statistics
                   .reduce((sum, m) => sum + m.count, 0)}
               </p>

[Survived] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:281:27
             <CardContent>
               <p className="text-3xl font-bold">
                 {analytics.message_statistics
-                  .filter(m => m.direction === 'outbound')
+                  .filter(() => undefined)
                   .reduce((sum, m) => sum + m.count, 0)}
               </p>
