[Survived] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:281:32
             <CardContent>
               <p className="text-3xl font-bold">
                 {analytics.message_statistics
-                  .filter(m => m.direction === 'outbound')
+                  .filter(m => true)
                   .reduce((sum, m) => sum + m.count, 0)}
               </p>

[Survived] ArithmeticOperator
components/integrations/WhatsAppBusinessIntegration.tsx:282:39
               <p className="text-3xl font-bold">
                 {analytics.message_statistics
                   .filter(m => m.direction === 'outbound')
-                  .reduce((sum, m) => sum + m.count, 0)}
+                  .reduce((sum, m) => sum - m.count, 0)}
               </p>
             </CardContent>

[Survived] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:282:27
               <p className="text-3xl font-bold">
                 {analytics.message_statistics
                   .filter(m => m.direction === 'outbound')
-                  .reduce((sum, m) => sum + m.count, 0)}
+                  .reduce(() => undefined, 0)}
               </p>
             </CardContent>

[Survived] MethodExpression
components/integrations/WhatsAppBusinessIntegration.tsx:292:18
             </CardHeader>
             <CardContent>
               <p className="text-3xl font-bold">
-                {analytics.message_statistics
-                  .filter(m => m.direction === 'inbound')
+                {analytics.message_statistics
                   .reduce((sum, m) => sum + m.count, 0)}
               </p>

[Survived] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:293:27
             <CardContent>
               <p className="text-3xl font-bold">
                 {analytics.message_statistics
-                  .filter(m => m.direction === 'inbound')
+                  .filter(() => undefined)
                   .reduce((sum, m) => sum + m.count, 0)}
               </p>

[Survived] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:293:32
             <CardContent>
               <p className="text-3xl font-bold">
                 {analytics.message_statistics
-                  .filter(m => m.direction === 'inbound')
+                  .filter(m => false)
                   .reduce((sum, m) => sum + m.count, 0)}
               </p>

[Survived] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:294:27
               <p className="text-3xl font-bold">
                 {analytics.message_statistics
                   .filter(m => m.direction === 'inbound')
-                  .reduce((sum, m) => sum + m.count, 0)}
+                  .reduce(() => undefined, 0)}
               </p>
             </CardContent>

[Survived] ArithmeticOperator
components/integrations/WhatsAppBusinessIntegration.tsx:294:39
               <p className="text-3xl font-bold">
                 {analytics.message_statistics
                   .filter(m => m.direction === 'inbound')
-                  .reduce((sum, m) => sum + m.count, 0)}
+                  .reduce((sum, m) => sum - m.count, 0)}
               </p>
             </CardContent>

[Killed] BooleanLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:310:12
         </TabsList>
 
         <TabsContent value="conversations" className="space-y-4">
-          {!isConnected ? (
+          {isConnected ? (
             <Alert variant="destructive">
               <AlertTriangle className="h-4 w-4" />
killedBy: WhatsAppBusinessIntegration displays conversations in conversations tab
statusReason: Error: Unable to find an element with the text: Recent Conversations. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Timeout] OptionalChaining
components/integrations/WhatsAppBusinessIntegration.tsx:332:84
                 {conversations.map((conversation) => (
                   <Card
                     key={conversation.id}
-                    className={`cursor-pointer transition-shadow hover:shadow-lg ${selectedConversation?.id === conversation.id
+                    className={`cursor-pointer transition-shadow hover:shadow-lg ${selectedConversation.id === conversation.id
                         ? 'border-2 border-blue-500'
                         : ''

[Survived] EqualityOperator
components/integrations/WhatsAppBusinessIntegration.tsx:332:84
                 {conversations.map((conversation) => (
                   <Card
                     key={conversation.id}
-                    className={`cursor-pointer transition-shadow hover:shadow-lg ${selectedConversation?.id === conversation.id
+                    className={`cursor-pointer transition-shadow hover:shadow-lg ${selectedConversation?.id !== conversation.id
                         ? 'border-2 border-blue-500'
                         : ''

[Survived] StringLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:334:27
                     key={conversation.id}
                     className={`cursor-pointer transition-shadow hover:shadow-lg ${selectedConversation?.id === conversation.id
                         ? 'border-2 border-blue-500'
-                        : ''
+                        : "Stryker was here!"
                       }`}
                     onClick={() => handleConversationSelect(conversation)}

[Survived] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:336:30
                         ? 'border-2 border-blue-500'
                         : ''
                       }`}
-                    onClick={() => handleConversationSelect(conversation)}
+                    onClick={() => undefined}
                   >
                     <CardContent className="pt-6">

[Killed] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:342:30
                       <div className="flex justify-between items-start mb-2">
                         <div>
                           <p className="font-medium">
-                            {conversation.name || conversation.phone_number}
+                            {true}
                           </p>
                           <p className="text-sm text-muted-foreground">
killedBy: WhatsAppBusinessIntegration displays conversations in conversations tab
statusReason: Error: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Killed] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:342:30
                       <div className="flex justify-between items-start mb-2">
                         <div>
                           <p className="font-medium">
-                            {conversation.name || conversation.phone_number}
+                            {false}
                           </p>
                           <p className="text-sm text-muted-foreground">
killedBy: WhatsAppBusinessIntegration displays conversations in conversations tab
statusReason: Error: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="overflow: unset;"
>
  <div>
    <div

[Survived] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:349:36
                           </p>
                         </div>
                         <Badge
-                          variant={conversation.status === 'active' ? 'default' : 'secondary'}
+                          variant={false ? 'default' : 'secondary'}
                           className={conversation.status === 'active' ? 'bg-green-500' : ''}
                         >

[Survived] EqualityOperator
components/integrations/WhatsAppBusinessIntegration.tsx:349:36
                           </p>
                         </div>
                         <Badge
-                          variant={conversation.status === 'active' ? 'default' : 'secondary'}
+                          variant={conversation.status !== 'active' ? 'default' : 'secondary'}
                           className={conversation.status === 'active' ? 'bg-green-500' : ''}
                         >

[Survived] EqualityOperator
components/integrations/WhatsAppBusinessIntegration.tsx:350:38
                         </div>
                         <Badge
                           variant={conversation.status === 'active' ? 'default' : 'secondary'}
-                          className={conversation.status === 'active' ? 'bg-green-500' : ''}
+                          className={conversation.status !== 'active' ? 'bg-green-500' : ''}
                         >
                           {conversation.status}

[Survived] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:350:38
                         </div>
                         <Badge
                           variant={conversation.status === 'active' ? 'default' : 'secondary'}
-                          className={conversation.status === 'active' ? 'bg-green-500' : ''}
+                          className={false ? 'bg-green-500' : ''}
                         >
                           {conversation.status}

[Survived] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:356:32
                         </Badge>
                       </div>
                       <div className="flex justify-between mt-3 text-sm text-muted-foreground">
-                        <span>{conversation.message_count || 0} messages</span>
+                        <span>{true} messages</span>
                         <span>{new Date(conversation.last_message_at).toLocaleDateString()}</span>
                       </div>

[Survived] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:356:32
                         </Badge>
                       </div>
                       <div className="flex justify-between mt-3 text-sm text-muted-foreground">
-                        <span>{conversation.message_count || 0} messages</span>
+                        <span>{false} messages</span>
                         <span>{new Date(conversation.last_message_at).toLocaleDateString()}</span>
                       </div>

[NoCoverage] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:373:36
               <CardHeader>
                 <div className="flex justify-between items-center">
                   <CardTitle>
-                    Messages with {selectedConversation.name || selectedConversation.phone_number}
+                    Messages with {false}
                   </CardTitle>
                   <Button

[NoCoverage] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:373:36
               <CardHeader>
                 <div className="flex justify-between items-center">
                   <CardTitle>
-                    Messages with {selectedConversation.name || selectedConversation.phone_number}
+                    Messages with {true}
                   </CardTitle>
                   <Button

[NoCoverage] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:378:30
                   <Button
                     variant="outline"
                     size="sm"
-                    onClick={() => fetchMessages(selectedConversation.whatsapp_id)}
+                    onClick={() => undefined}
                   >
                     <RefreshCw className="mr-2 h-4 w-4" />

[NoCoverage] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:390:42
                   {messages.map((message) => (
                     <div
                       key={message.id}
-                      className={`flex ${message.direction === 'outbound' ? 'justify-end' : 'justify-start'
+                      className={`flex ${false ? 'justify-end' : 'justify-start'
                         }`}
                     >

[NoCoverage] EqualityOperator
components/integrations/WhatsAppBusinessIntegration.tsx:390:42
                   {messages.map((message) => (
                     <div
                       key={message.id}
-                      className={`flex ${message.direction === 'outbound' ? 'justify-end' : 'justify-start'
+                      className={`flex ${message.direction !== 'outbound' ? 'justify-end' : 'justify-start'
                         }`}
                     >

[NoCoverage] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:394:75
                         }`}
                     >
                       <div
-                        className={`max-w-xs md:max-w-md p-3 rounded-lg ${message.direction === 'outbound'
+                        className={`max-w-xs md:max-w-md p-3 rounded-lg ${false
                             ? 'bg-blue-500 text-white'
                             : 'bg-gray-100 text-black'

[NoCoverage] EqualityOperator
components/integrations/WhatsAppBusinessIntegration.tsx:394:75
                         }`}
                     >
                       <div
-                        className={`max-w-xs md:max-w-md p-3 rounded-lg ${message.direction === 'outbound'
+                        className={`max-w-xs md:max-w-md p-3 rounded-lg ${message.direction !== 'outbound'
                             ? 'bg-blue-500 text-white'
                             : 'bg-gray-100 text-black'

[NoCoverage] EqualityOperator
components/integrations/WhatsAppBusinessIntegration.tsx:400:28
                           }`}
                       >
                         <p className="text-sm font-medium mb-1">
-                          {message.direction === 'outbound' ? 'You' : 'Customer'}
+                          {message.direction !== 'outbound' ? 'You' : 'Customer'}
                         </p>
                         <p>

[NoCoverage] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:400:28
                           }`}
                       >
                         <p className="text-sm font-medium mb-1">
-                          {message.direction === 'outbound' ? 'You' : 'Customer'}
+                          {true ? 'You' : 'Customer'}
                         </p>
                         <p>

[NoCoverage] EqualityOperator
components/integrations/WhatsAppBusinessIntegration.tsx:403:28
                           {message.direction === 'outbound' ? 'You' : 'Customer'}
                         </p>
                         <p>
-                          {message.message_type === 'text'
+                          {message.message_type !== 'text'
                             ? message.content?.body
                             : `[${message.message_type.toUpperCase()}]`}

[NoCoverage] ConditionalExpression
components/integrations/WhatsAppBusinessIntegration.tsx:403:28
                           {message.direction === 'outbound' ? 'You' : 'Customer'}
                         </p>
                         <p>
-                          {message.message_type === 'text'
+                          {false
                             ? message.content?.body
                             : `[${message.message_type.toUpperCase()}]`}

[NoCoverage] OptionalChaining
components/integrations/WhatsAppBusinessIntegration.tsx:404:31
                         </p>
                         <p>
                           {message.message_type === 'text'
-                            ? message.content?.body
+                            ? message.content.body
                             : `[${message.message_type.toUpperCase()}]`}
                         </p>

[NoCoverage] MethodExpression
components/integrations/WhatsAppBusinessIntegration.tsx:405:35
                         <p>
                           {message.message_type === 'text'
                             ? message.content?.body
-                            : `[${message.message_type.toUpperCase()}]`}
+                            : `[${message.message_type.toLowerCase()}]`}
                         </p>
                         <p className="text-xs mt-2 opacity-70">

[NoCoverage] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:420:31
                   <Input
                     placeholder="Type a message..."
                     value={newMessage}
-                    onChange={(e) => setNewMessage(e.target.value)}
+                    onChange={() => undefined}
                     onKeyPress={(e) => {
                       if (e.key === 'Enter' && !e.shiftKey) {

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:421:40
                     placeholder="Type a message..."
                     value={newMessage}
                     onChange={(e) => setNewMessage(e.target.value)}
-                    onKeyPress={(e) => {
-                      if (e.key === 'Enter' && !e.shiftKey) {
-                        e.preventDefault();
-                        handleSendMessage();
-                      }
-                    }}
+                    onKeyPress={(e) => {}}
                   />
                   <Button onClick={handleSendMessage} disabled={!newMessage.trim()}>

[NoCoverage] BlockStatement
components/integrations/WhatsAppBusinessIntegration.tsx:422:61
                     value={newMessage}
                     onChange={(e) => setNewMessage(e.target.value)}
                     onKeyPress={(e) => {
-                      if (e.key === 'Enter' && !e.shiftKey) {
-                        e.preventDefault();
-                        handleSendMessage();
-                      }
+                      if (e.key === 'Enter' && !e.shiftKey) {}
                     }}
                   />

[NoCoverage] LogicalOperator
components/integrations/WhatsAppBusinessIntegration.tsx:422:27
                     value={newMessage}
                     onChange={(e) => setNewMessage(e.target.value)}
                     onKeyPress={(e) => {
-                      if (e.key === 'Enter' && !e.shiftKey) {
+                      if (e.key === 'Enter' || !e.shiftKey) {
                         e.preventDefault();
                         handleSendMessage();

[NoCoverage] BooleanLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:428:65
                       }
                     }}
                   />
-                  <Button onClick={handleSendMessage} disabled={!newMessage.trim()}>
+                  <Button onClick={handleSendMessage} disabled={newMessage.trim()}>
                     <Send className="h-4 w-4" />
                   </Button>

[NoCoverage] MethodExpression
components/integrations/WhatsAppBusinessIntegration.tsx:428:66
                       }
                     }}
                   />
-                  <Button onClick={handleSendMessage} disabled={!newMessage.trim()}>
+                  <Button onClick={handleSendMessage} disabled={!newMessage}>
                     <Send className="h-4 w-4" />
                   </Button>

[Survived] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:452:55
                 </CardHeader>
                 <CardContent>
                   <div className="space-y-3">
-                    {analytics.message_statistics.map((stat, index) => (
-                      <div key={index} className="flex justify-between">
-                        <span className="text-sm">
-                          {stat.direction} {stat.message_type} ({stat.status})
-                        </span>
-                        <span className="font-bold">{stat.count}</span>
-                      </div>
-                    ))}
+                    {analytics.message_statistics.map(() => undefined)}
                   </div>
                 </CardContent>

[Survived] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:470:51
                 </CardHeader>
                 <CardContent>
                   <div className="space-y-3">
-                    {analytics.contact_growth.map((growth, index) => (
-                      <div key={index} className="flex justify-between">
-                        <span className="text-sm">{growth.date}</span>
-                        <span className="font-bold">+{growth.new_contacts}</span>
-                      </div>
-                    ))}
+                    {analytics.contact_growth.map(() => undefined)}
                   </div>
                 </CardContent>

[NoCoverage] BooleanLiteral
components/integrations/WhatsAppBusinessIntegration.tsx:524:71
             </div>
           </div>
           <DialogFooter>
-            <Button variant="outline" onClick={() => setIsComposeOpen(false)}>
+            <Button variant="outline" onClick={() => setIsComposeOpen(true)}>
               Cancel
             </Button>

[Survived] ArrowFunction
components/integrations/WhatsAppBusinessIntegration.tsx:524:48
             </div>
           </div>
           <DialogFooter>
-            <Button variant="outline" onClick={() => setIsComposeOpen(false)}>
+            <Button variant="outline" onClick={() => undefined}>
               Cancel
             </Button>
