[NoCoverage] LogicalOperator
lib/email.ts:5:9
 
 export const sendEmail = async (options: { to: string, subject: string, html: string }) => {
     // Check if SMTP configuration is present
-    if (!process.env.SMTP_HOST || !process.env.SMTP_USER || !process.env.SMTP_PASS) {
+    if ((!process.env.SMTP_HOST || !process.env.SMTP_USER) && !process.env.SMTP_PASS) {
         console.warn('⚠️ SMTP configuration missing. Email not sent.');
         console.log(`[Mock Email] To: ${options.to}, Subject: ${options.subject}`);

[NoCoverage] ConditionalExpression
lib/email.ts:5:9
 
 export const sendEmail = async (options: { to: string, subject: string, html: string }) => {
     // Check if SMTP configuration is present
-    if (!process.env.SMTP_HOST || !process.env.SMTP_USER || !process.env.SMTP_PASS) {
+    if (true) {
         console.warn('⚠️ SMTP configuration missing. Email not sent.');
         console.log(`[Mock Email] To: ${options.to}, Subject: ${options.subject}`);

[NoCoverage] BooleanLiteral
lib/email.ts:8:16
     if (!process.env.SMTP_HOST || !process.env.SMTP_USER || !process.env.SMTP_PASS) {
         console.warn('⚠️ SMTP configuration missing. Email not sent.');
         console.log(`[Mock Email] To: ${options.to}, Subject: ${options.subject}`);
-        return false;
+        return true;
     }
 

[NoCoverage] BlockStatement
lib/email.ts:11:9
         return false;
     }
 
-    try {
-        const transporter = nodemailer.createTransport({
-            host: process.env.SMTP_HOST,
-            port: parseInt(process.env.SMTP_PORT || '587'),
-            secure: process.env.SMTP_SECURE === 'true', // true for 465, false for other ports
-            auth: {
-                user: process.env.SMTP_USER,
-                pass: process.env.SMTP_PASS,
-            },
-        });
-
-        const info = await transporter.sendMail({
-            from: process.env.EMAIL_FROM || '"Atom Platform" <noreply@atom.ai>',
-            to: options.to,
-            subject: options.subject,
-            html: options.html,
-        });
-
-        console.log(`Email sent: ${info.messageId}`);
-        return true;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error sending email:', error);
         return false;

[NoCoverage] ConditionalExpression
lib/email.ts:14:28
     try {
         const transporter = nodemailer.createTransport({
             host: process.env.SMTP_HOST,
-            port: parseInt(process.env.SMTP_PORT || '587'),
+            port: parseInt(false),
             secure: process.env.SMTP_SECURE === 'true', // true for 465, false for other ports
             auth: {

[NoCoverage] ConditionalExpression
lib/email.ts:14:28
     try {
         const transporter = nodemailer.createTransport({
             host: process.env.SMTP_HOST,
-            port: parseInt(process.env.SMTP_PORT || '587'),
+            port: parseInt(true),
             secure: process.env.SMTP_SECURE === 'true', // true for 465, false for other ports
             auth: {

[NoCoverage] ConditionalExpression
lib/email.ts:15:21
         const transporter = nodemailer.createTransport({
             host: process.env.SMTP_HOST,
             port: parseInt(process.env.SMTP_PORT || '587'),
-            secure: process.env.SMTP_SECURE === 'true', // true for 465, false for other ports
+            secure: true, // true for 465, false for other ports
             auth: {
                 user: process.env.SMTP_USER,

[NoCoverage] EqualityOperator
lib/email.ts:15:21
         const transporter = nodemailer.createTransport({
             host: process.env.SMTP_HOST,
             port: parseInt(process.env.SMTP_PORT || '587'),
-            secure: process.env.SMTP_SECURE === 'true', // true for 465, false for other ports
+            secure: process.env.SMTP_SECURE !== 'true', // true for 465, false for other ports
             auth: {
                 user: process.env.SMTP_USER,

[NoCoverage] LogicalOperator
lib/email.ts:23:19
         });
 
         const info = await transporter.sendMail({
-            from: process.env.EMAIL_FROM || '"Atom Platform" <noreply@atom.ai>',
+            from: process.env.EMAIL_FROM && '"Atom Platform" <noreply@atom.ai>',
             to: options.to,
             subject: options.subject,

[NoCoverage] ConditionalExpression
lib/email.ts:23:19
         });
 
         const info = await transporter.sendMail({
-            from: process.env.EMAIL_FROM || '"Atom Platform" <noreply@atom.ai>',
+            from: true,
             to: options.to,
             subject: options.subject,

[NoCoverage] StringLiteral
lib/email.ts:29:21
             html: options.html,
         });
 
-        console.log(`Email sent: ${info.messageId}`);
+        console.log(``);
         return true;
     } catch (error) {

[NoCoverage] BooleanLiteral
lib/email.ts:30:16
         });
 
         console.log(`Email sent: ${info.messageId}`);
-        return true;
+        return false;
     } catch (error) {
         console.error('Error sending email:', error);

[NoCoverage] BlockStatement
lib/email.ts:31:21
 
         console.log(`Email sent: ${info.messageId}`);
         return true;
-    } catch (error) {
-        console.error('Error sending email:', error);
-        return false;
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
lib/email.ts:32:23
         console.log(`Email sent: ${info.messageId}`);
         return true;
     } catch (error) {
-        console.error('Error sending email:', error);
+        console.error("", error);
         return false;
     }

[NoCoverage] BooleanLiteral
lib/email.ts:33:16
         return true;
     } catch (error) {
         console.error('Error sending email:', error);
-        return false;
+        return true;
     }
 };

[Killed] BlockStatement
lib/email.ts:37:78
     }
 };
 
-export const generateVerificationEmailHTML = (code: string, name: string) => {
-    return `
-    <div style="font-family: Arial, sans-serif; max-width: 600px; margin: 0 auto;">
-        <h2 style="color: #333;">Hello ${name},</h2>
-        <p>Your verification code for Atom Platform is:</p>
-        <div style="background-color: #f4f4f4; padding: 15px; text-align: center; border-radius: 5px; margin: 20px 0;">
-            <strong style="font-size: 24px; letter-spacing: 5px; color: #0070f3;">${code}</strong>
-        </div>
-        <p>This code will expire in 15 minutes.</p>
-        <hr style="border: 1px solid #eee; margin-top: 30px;" />
-        <p style="color: #888; font-size: 12px;">If you didn't request this code, you can safely ignore this email.</p>
-    </div>
-    `;
-};
+export const generateVerificationEmailHTML = (code: string, name: string) => {};
 
killedBy: Email Utilities - Property-Based Tests should always include verification code in HTML output
statusReason: Error: Property failed after 1 tests
{ seed: -83201171, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["000000"," "]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
